cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
	<!--

Generated with Magillem Design Services S.A MRV CMSIS SVD generator.
MRV generator version : 1.0
2016/02/17 14:40:43
-->
	<vendor>nxp.com</vendor>
	<name>LPC5411x</name>
	<version>1.2</version>
	<description>LPC5411x, ARM Cortex-M4, ARM Cortex-M0+ coprocessor</description>
	<licenseText>
		Software that is described herein is for illustrative purposes only
		which provides customers with programming information regarding the
		products. This software is supplied "AS IS" without any warranties.
		NXP Semiconductors assumes no responsibility or liability for the
		use of the software, conveys no license or title under any patent,
		copyright, or mask work right to the product. NXP Semiconductors
		reserves the right to make changes in the software without
		notification. NXP Semiconductors also make no representation or
		warranty that such application will be suitable for the specified
		use without further testing or modification.	
    </licenseText>
	<cpu>
		<name>CM4</name>
		<revision>r0p1</revision>
		<endian>little</endian>
		<mpuPresent>true</mpuPresent>
		<fpuPresent>true</fpuPresent>
		<vtorPresent>true</vtorPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>true</vendorSystickConfig>
	</cpu>
	<!-- Bus Interface Properties -->
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<!-- -->
	<!-- Register Default Properties -->
	<size>32</size>
	<access>read-write</access>
	<!-- -->
	<peripherals>
		<peripheral>
			<name>SYSCON</name>
			<version>1.0</version>
			<description>LPC5411x System configuration (SYSCON)</description>
			<groupName>syscon</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x40024</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AHBMATPRIO</name>
					<description>AHB multilayer matrix priority control</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000fff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>12</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PRI_DMA</name>
							<description>DMA controller priority.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_USB</name>
							<description>USB interface priority.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_M0</name>
							<description>Cortex-M0+ bus priority. Present on selected devices.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_SYS</name>
							<description>Cortex M4 System bus priority.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_DCODE</name>
							<description>Cortex M4 D-Code bus priority.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_ICODE</name>
							<description>Cortex-M4 I-Code bus priority. Should typically be lower than PRI_DCODE for best operation.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTCKCAL</name>
					<description>System tick counter calibration</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x03ffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>26</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>NOREF</name>
							<description>Initial value for the Systick timer.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SKEW</name>
							<description>Initial value for the Systick timer.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAL</name>
							<description>System tick timer calibration value.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NMISRC</name>
					<description>NMI Source Select</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xc0003f3f</resetMask>
					<fields>
						<field>
							<name>NMIENM4</name>
							<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by IRQM4.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NMIENM0</name>
							<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by IRQM0. Present on selected devices.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>14</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>IRQM0</name>
							<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) for the Cortex-M0+, if enabled by NMIENM0. Present on selected devices.</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>IRQM4</name>
							<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) for the Cortex-M4, if enabled by NMIENM4.</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCTRL</name>
					<description>Asynchronous APB Control</description>
					<addressOffset>0x4c</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enables the asynchronous APB bridge and subsystem.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ENABLE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Asynchronous APB bridge is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Asynchronous APB bridge is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PIOPORCAP0</name>
					<description>POR captured value of port 0</description>
					<addressOffset>0xc0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIOPORCAP</name>
							<description>State of PIO0_31 through PIO0_0 at power-on reset</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIOPORCAP1</name>
					<description>POR captured value of port 1</description>
					<addressOffset>0xc4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIOPORCAP</name>
							<description>State of PIO1_31 through PIO1_0 at power-on reset</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIORESCAP0</name>
					<description>Reset captured value of port 0</description>
					<addressOffset>0xd0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIORESCAP</name>
							<description>State of PIO0_31 through PIO0_0 for resets other than POR.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIORESCAP1</name>
					<description>Reset captured value of port 1</description>
					<addressOffset>0xd4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PIORESCAP</name>
							<description>State of PIO1_31 through PIO1_0 for resets other than POR.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRL0</name>
					<description>Peripheral reset control 0</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x087ced80</resetMask>
					<fields>
						<field>
							<name>reserved5</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ADC0_RST</name>
							<description>ADC0 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved4</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>23</lsb>
							<msb>26</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>WWDT_RST</name>
							<description>Watchdog timer reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC_RST</name>
							<description>CRC generator reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA_RST</name>
							<description>DMA reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GINT_RST</name>
							<description>Grouped interrupt (GINT) reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINT_RST</name>
							<description>Pin interrupt (PINT) reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved3</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>GPIO1_RST</name>
							<description>GPIO1 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIO0_RST</name>
							<description>GPIO0 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IOCON_RST</name>
							<description>IOCON reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MUX_RST</name>
							<description>Input mux reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved6</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FMC_RST</name>
							<description>Flash accelerator reset control. Note that the FMC must not be reset while executing from flash, and must be reconfigured after reset. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLASH_RST</name>
							<description>Flash controller reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRL1</name>
					<description>Peripheral reset control 1</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0e4ffc05</resetMask>
					<fields>
						<field>
							<name>reserved4</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CT32B1_RST</name>
							<description>CT32B1 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT32B0_RST</name>
							<description>CT32B0 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USB_RST</name>
							<description>USB reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved3</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>23</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CT32B2_RST</name>
							<description>CT32B2 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DMIC_RST</name>
							<description>Digital microphone interface reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC7_RST</name>
							<description>Flexcomm 7 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC6_RST</name>
							<description>Flexcomm 6 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC5_RST</name>
							<description>Flexcomm 5 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC4_RST</name>
							<description>Flexcomm 4 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC3_RST</name>
							<description>Flexcomm 3 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC2_RST</name>
							<description>Flexcomm 2 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC1_RST</name>
							<description>Flexcomm 1 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FC0_RST</name>
							<description>Flexcomm 0 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UTICK_RST</name>
							<description>Micro-tick Timer reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SCT0_RST</name>
							<description>State configurable timer 0 (SCT0) reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MRT_RST</name>
							<description>Multi-rate timer (MRT) reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLSET0</name>
					<description>Set bits in PRESETCTRL0</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_SET0</name>
							<description>Writing ones to this register sets the corresponding bit or bits in the PRESETCTRL0 register, if they are implemented. Bits that do not correspond to defined bits in PRESETCTRL0 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
