cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>PRESETCTRLSET1</name>
					<description>Set bits in PRESETCTRL1</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_SET1</name>
							<description>Writing ones to this register sets the corresponding bit or bits in the PRESETCTRL1 register, if they are implemented. Bits that do not correspond to defined bits in PRESETCTRL1 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLCLR0</name>
					<description>Clear bits in PRESETCTRL0</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_CLR0</name>
							<description>Writing ones to this register clears the corresponding bit or bits in the PRESETCTRL0 register, if they are implemented. Bits that do not correspond to defined bits in PRESETCTRL0 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESETCTRLCLR1</name>
					<description>Clear bits in PRESETCTRL1</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RST_CLR1</name>
							<description>Writing ones to this register clears the corresponding bit or bits in the PRESETCTRL1 register, if they are implemented. Bits that do not correspond to defined bits in PRESETCTRL1 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSRSTSTAT</name>
					<description>System reset status register</description>
					<addressOffset>0x1f0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000001f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>-</description>
							<lsb>5</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SYSRST</name>
							<description>Status of the software system reset</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SYSRST_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_SYSTEM_RESET_DETECTED</name>
									<description>No System reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_RESET_DETECTED</name>
									<description>System reset detected. Writing a one clears this reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD</name>
							<description>Status of the Brown-out detect reset</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BOD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_BOD_RESET_DETECTED</name>
									<description>No BOD reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOD_RESET_DETECTED</name>
									<description>BOD reset detected. Writing a one clears this reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>Status of the Watchdog reset</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WDT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_WDT_RESET_DETECTED</name>
									<description>No WDT reset detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WDT_RESET_DETECTED</name>
									<description>WDT reset detected. Writing a one clears this reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTRST</name>
							<description>Status of the external RESET pin. External reset status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>EXTRST_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_RESET_DETECTED</name>
									<description>No reset event detected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_DETECTED</name>
									<description>Reset detected. Writing a one clears this reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POR</name>
							<description>POR reset status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>POR_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_POR_DETECTED</name>
									<description>No POR detected</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POR_DETECTED</name>
									<description>POR detected. Writing a one clears this reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRL0</name>
					<description>AHB Clock control 0</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<resetValue>0x0000018b</resetValue>
					<resetMask>0x0cfced9a</resetMask>
					<fields>
						<field>
							<name>reserved7</name>
							<description>Reserved</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ADC0</name>
							<description>Enables the clock for the ADC0 register interface. 0 = Disable; 1 = Enable.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAILBOX</name>
							<description>Enables the clock for the Mailbox. 0 = Disable; 1 = Enable. Present on selected devices</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved6</name>
							<description>Reserved</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>RTC</name>
							<description>Enables the bus clock for the RTC. 0 = Disable; 1 = Enable.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WWDT</name>
							<description>Enables the clock for the Watchdog Timer. 0 = Disable; 1 = Enable.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CRC</name>
							<description>Enables the clock for the CRC engine. 0 = Disable; 1 = Enable.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMA</name>
							<description>Enables the clock for the DMA controller. 0 = Disable; 1 = Enable.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GINT</name>
							<description>Enables the clock for the grouped pin interrupt block. 0 = Disable; 1 = Enable.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINT</name>
							<description>Enables the clock for the pin interrupt block.0 = Disable; 1 = Enable.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved5</name>
							<description>Reserved</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>GPIO1</name>
							<description>Enables the clock for the GPIO1 port registers. 0 = Disable; 1 = Enable.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GPIO0</name>
							<description>Enables the clock for the GPIO0 port registers. 0 = Disable; 1 = Enable.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IOCON</name>
							<description>Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved4</name>
							<description>Reserved</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>INPUTMUX</name>
							<description>Enables the clock for the input muxes. 0 = Disable; 1 = Enable.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved8</name>
							<description>Reserved</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved3</name>
							<description>Reserved</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FMC</name>
							<description>Enables the clock for the Flash accelerator. 0 = Disable; 1 = Enable. This clock is needed if the flash is being read.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLASH</name>
							<description>Enables the clock for the flash controller. 0 = Disable; 1 = Enable. This clock is needed for flash programming, not for flash read.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved2</name>
							<description>Reserved</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SRAM2</name>
							<description>Enables the clock for SRAM2. 0 = Disable; 1 = Enable.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRAM1</name>
							<description>Enables the clock for SRAM1. 0 = Disable; 1 = Enable.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ROM</name>
							<description>Enables the clock for the Boot ROM. 0 = Disable; 1 = Enable.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. This read-only bit cannot be cleared.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRL1</name>
					<description>AHB Clock control 1</description>
					<addressOffset>0x204</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0e4ffc05</resetMask>
					<fields>
						<field>
							<name>reserved4</name>
							<description>Reserved</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CT32B1</name>
							<description>Enables the clock for timer CT32B1. 0 = Disable; 1 = Enable.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT32B0</name>
							<description>Enables the clock for timer CT32B0. 0 = Disable; 1 = Enable.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USB</name>
							<description>Enables the clock for the USB interface. 0 = Disable; 1 = Enable.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved3</name>
							<description>Reserved</description>
							<lsb>23</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CT32B2</name>
							<description>Enables the clock for CT32B 2. 0 = Disable; 1 = Enable.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved2</name>
							<description>Reserved</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DMIC</name>
							<description>Enables the clock for the digital microphone interface. 0 = Disable; 1 = Enable.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM7</name>
							<description>Enables the clock for Flexcomm 7. 0 = Disable; 1 = Enable.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM6</name>
							<description>Enables the clock for Flexcomm 6. 0 = Disable; 1 = Enable.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM5</name>
							<description>Enables the clock for Flexcomm 5. 0 = Disable; 1 = Enable.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM4</name>
							<description>Enables the clock for Flexcomm 4. 0 = Disable; 1 = Enable.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM3</name>
							<description>Enables the clock for Flexcomm 3. 0 = Disable; 1 = Enable.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM2</name>
							<description>Enables the clock for Flexcomm 2. 0 = Disable; 1 = Enable.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM1</name>
							<description>Enables the clock for Flexcomm 1. 0 = Disable; 1 = Enable.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FLEXCOMM0</name>
							<description>Enables the clock for Flexcomm 0. 0 = Disable; 1 = Enable.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UTICK</name>
							<description>Enables the clock for the Micro-tick Timer. 0 = Disable; 1 = Enable.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>3</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SCT0</name>
							<description>Enables the clock for SCT0. 0 = Disable; 1 = Enable.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MRT</name>
							<description>Enables the clock for the Multi-Rate Timer. 0 = Disable; 1 = Enable.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLSET0</name>
					<description>Set bits in AHBCLKCTRL0</description>
					<addressOffset>0x220</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_SET0</name>
							<description>Writing ones to this register sets the corresponding bit or bits in the AHBCLKCTRL0 register, if they are implemented. Bits that do not correspond to defined bits in AHBCLKCTRL0 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLSET1</name>
					<description>Set bits in AHBCLKCTRL1</description>
					<addressOffset>0x224</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_SET1</name>
							<description>Writing ones to this register sets the corresponding bit or bits in the AHBCLKCTRL1 register, if they are implemented. Bits that do not correspond to defined bits in AHBCLKCTRL1 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLCLR0</name>
					<description>Clear bits in AHBCLKCTRL0</description>
					<addressOffset>0x240</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_CLR0</name>
							<description>Writing ones to this register clears the corresponding bit or bits in the AHBCLKCTRL0 register, if they are implemented. Bits that do not correspond to defined bits in AHBCLKCTRL0 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKCTRLCLR1</name>
					<description>Clear bits in AHBCLKCTRL1</description>
					<addressOffset>0x244</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CLK_CLR1</name>
							<description>Writing ones to this register clears the corresponding bit or bits in the AHBCLKCTRL1 register, if they are implemented. Bits that do not correspond to defined bits in AHBCLKCTRL1 are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MAINCLKSELA</name>
					<description>Main clock source select A</description>
					<addressOffset>0x280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Clock source for main clock source selector A</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz (fro_12m)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN (clk_in)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator (wdt_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
