cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>MAINCLKSELB</name>
					<description>Main clock source select B</description>
					<addressOffset>0x284</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Clock source for main clock source selector B. Selects the clock source for the main clock.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MAINCLKSELA</name>
									<description>MAINCLKSELA. Use the clock source selected in MAINCLKSELA register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved setting</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_OSC_OUTPUT</name>
									<description>RTC oscillator 32 kHz output (32k_clk)</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKOUTSELA</name>
					<description>CLKOUT clock source select A</description>
					<addressOffset>0x288</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>CLKOUT clock source selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock (main_clk)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN (clk_in)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator (wdt_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>PLL output (pll_clk)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz (fro_12m)</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_OSC_OUTPUT</name>
									<description>RTC oscillator 32 kHz output (32k_clk)</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCLKSEL</name>
					<description>PLL clock source select</description>
					<addressOffset>0x290</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>System PLL clock source selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz (fro_12m)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLKIN</name>
									<description>CLKIN (clk_in)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator (wdt_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RTC_32_KHZ_CLOCK</name>
									<description>RTC 32 kHz clock (32k_clk)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCLKSEL</name>
					<description>ADC clock source select</description>
					<addressOffset>0x2a4</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>ADC clock source selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock (main_clk)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCLKSEL</name>
					<description>USB clock source select</description>
					<addressOffset>0x2a8</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>USB device clock source selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock (main_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<dimIndex>0,1,2,3,4,5,6,7</dimIndex>
					<name>FXCOMCLKSEL[%s]</name>
					<description>Flexcomm 0 clock source select</description>
					<addressOffset>0x2b0</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Flexcomm clock source selection. One per Flexcomm.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz (fro_12m)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCLK_INPUT</name>
									<description>MCLK pin input, when selected in IOCON (mclk_in)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRG_CLOCK_OUTPUT</name>
									<description>FRG clock, the output of the fractional rate generator (frg_clk)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MCLKCLKSEL</name>
					<description>MCLK clock source select</description>
					<addressOffset>0x2e0</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>MCLK source select. This may be used by Flexcomms that support I2S, and/or by the digital microphone subsystem.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock (main_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FRGCLKSEL</name>
					<description>Fractional Rate Generator clock source select</description>
					<addressOffset>0x2e8</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Fractional Rate Generator clock source select.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock (main_clk)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz (fro_12m)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMICCLKSEL</name>
					<description>Digital microphone (D-Mic) subsystem clock select</description>
					<addressOffset>0x2ec</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>D-Mic subsystem clock source select.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz (fro_12m)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_HF</name>
									<description>FRO 96 or 48 MHz (fro_hf)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SYSTEM_PLL_OUTPUT</name>
									<description>System PLL output (pll_clk)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCLK_INPUT</name>
									<description>MCLK pin input, when selected in IOCON (mclk_in)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock (main_clk)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WATCHDOG_OSCILLATOR</name>
									<description>Watchdog oscillator (wdt_clk)</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved setting</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NONE</name>
									<description>None, this may be selected in order to reduce power when no output is needed.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICKCLKDIV</name>
					<description>SYSTICK clock divider</description>
					<addressOffset>0x300</addressOffset>
					<size>32</size>
					<resetValue>0x40000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBCLKDIV</name>
					<description>AHB clock divider</description>
					<addressOffset>0x380</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKOUTDIV</name>
					<description>CLKOUT clock divider</description>
					<addressOffset>0x384</addressOffset>
					<size>32</size>
					<resetValue>0x40000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
