cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>ADCCLKDIV</name>
					<description>ADC clock divider</description>
					<addressOffset>0x394</addressOffset>
					<size>32</size>
					<resetValue>0x40000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCLKDIV</name>
					<description>USB clock divider</description>
					<addressOffset>0x398</addressOffset>
					<size>32</size>
					<resetValue>0x40000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FRGCTRL</name>
					<description>Fractional rate divider</description>
					<addressOffset>0x3a0</addressOffset>
					<size>32</size>
					<resetValue>0x000000ff</resetValue>
					<resetMask>0x0000ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MULT</name>
							<description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIV</name>
							<description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMICCLKDIV</name>
					<description>DMIC clock divider</description>
					<addressOffset>0x3a8</addressOffset>
					<size>32</size>
					<resetValue>0x40000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>I2SMCLKDIV</name>
					<description>I2S MCLK clock divider</description>
					<addressOffset>0x3ac</addressOffset>
					<size>32</size>
					<resetValue>0x40000000</resetValue>
					<resetMask>0x600000ff</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HALT</name>
							<description>Halts the divider counter. The intent is to allow the divider clock source to be changed without the risk of a glitch at the output.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RESET</name>
							<description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIV</name>
							<description>Clock divider value. 0: Divide by 1 up to 255: Divide by 256.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLASHCFG</name>
					<description>Flash wait states configuration</description>
					<addressOffset>0x400</addressOffset>
					<size>32</size>
					<resetValue>0x0000001a</resetValue>
					<resetMask>0x0000f07f</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FLASHTIM</name>
							<description>Flash memory access time. The number of system clocks used for flash accesses is equal to FLASHTIM +1.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>FLASHTIM_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>N_1_CLOCK_CYCLE</name>
									<description>1 system clock flash access time (for system clock rates up to 12 MHz).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_2_CLOCK_CYCLES</name>
									<description>2 system clocks flash access time (for system clock rates up to 30 MHz).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_3_CLOCK_CYCLES</name>
									<description>3 system clocks flash access time (for system clock rates up to 60 MHz).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_4_CLOCK_CYCLES</name>
									<description>4 system clocks flash access time (for system clock rates up to 85 MHz).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_5_CLOCK_CYCLES</name>
									<description>5 system clocks flash access time (for system clock rates up to 100 MHz).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>7</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PREFOVR</name>
							<description>Prefetch override. This bit only applies when PREFEN = 1 and a buffered instruction is completing for which the next flash line is not already buffered or being prefetched.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PREFOVR_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>PREFETCH_COMPLETED</name>
									<description>Any previously initiated prefetch will be completed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PREFETCH_ABORT</name>
									<description>Any previously initiated prefetch will be aborted, and the next flash line following the current execution address will be prefetched if not already buffered.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREFEN</name>
							<description>Prefetch enable.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PREFEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_PREFETCH</name>
									<description>No instruction prefetch is performed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PREFETCH</name>
									<description>If the FETCHCFG field is not 0, the next flash line following the current execution address is automatically prefetched if it is not already buffered.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACCEL</name>
							<description>Acceleration enable.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ACCEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Flash acceleration is disabled. Every flash read (including those fulfilled from a buffer) takes FLASHTIM + 1 system clocks. This allows more determinism at a cost of performance.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Flash acceleration is enabled. Performance is enhanced, dependent on other FLASHCFG settings.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DATACFG</name>
							<description>Data read configuration. This field determines how flash accelerator buffers are used for data accesses.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DATACFG_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NOT_BUFFERED</name>
									<description>Data accesses from flash are not buffered. Every data access from the CPU results in a read of the flash memory.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_BUFFER</name>
									<description>One buffer is used for all data accesses.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALL_BUFFERS</name>
									<description>All buffers may be used for data accesses.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved setting, do not use.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FETCHCFG</name>
							<description>Instruction fetch configuration. This field determines how flash accelerator buffers are used for instruction fetches.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>FETCHCFG_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_BUFFER</name>
									<description>Instruction fetches from flash are not buffered. Every fetch request from the CPU results in a read of the flash memory. This setting may use significantly more power than when buffering is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE_BUFFER</name>
									<description>One buffer is used for all instruction fetches.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ALL_BUFFERS</name>
									<description>All buffers may be used for instruction fetches.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved setting, do not use.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCLKCTRL</name>
					<description>USB clock control</description>
					<addressOffset>0x40c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000002</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>POL_CLK</name>
							<description>USB_NEED_CLK polarity for triggering the USB wake-up interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>POL_CLK_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Falling edge of the USB_NEED_CLK triggers the USB wake-up (default).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Rising edge of the USB_NEED_CLK triggers the USB wake-up.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCLKSTAT</name>
					<description>USB clock status</description>
					<addressOffset>0x410</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>NEED_CLKST</name>
							<description>USB_NEED_CLK signal status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>NEED_CLKST_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>LOW</name>
									<description>Low</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>High</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FREQMECTRL</name>
					<description>Frequency measure register</description>
					<addressOffset>0x418</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x80003fff</resetMask>
					<fields>
						<field>
							<name>PROG</name>
							<description>Set this bit to one to initiate a frequency measurement cycle. Hardware clears this bit when the measurement cycle has completed and there is valid capture data in the CAPVAL field (bits 13:0).</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>14</lsb>
							<msb>30</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPVAL</name>
							<description>Stores the capture result which is used to calculate the frequency of the target clock. This field is read-only.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCLKIO</name>
					<description>MCLK input/output control</description>
					<addressOffset>0x420</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved, only zero should be written.</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIR</name>
							<description>MCLK direction control.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIR_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT</name>
									<description>The MCLK function is an input.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTPUT</name>
									<description>The MCLK function is an output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
