cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>FROCTRL</name>
					<description>FRO oscillator control</description>
					<addressOffset>0x500</addressOffset>
					<size>32</size>
					<resetValue>0x40004000</resetValue>
					<resetMask>0xc3ff7fff</resetMask>
					<fields>
						<field>
							<name>WRTRIM</name>
							<description>Write Trim value. Must be written to 1 to modify the SEL or TRIM fields, during the same write. This bit always reads as 0.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HSPDCLK</name>
							<description>High speed clock disable. Allows disabling the highs-speed FRO output if it is not needed.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>HSPDCLK_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The high-speed FRO output is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The selected high-speed FRO output (48 MHz or 96 MHz) is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved, only zero should be written.</description>
							<lsb>26</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>USBMODCHG</name>
							<description>USB Mode value Change flag. When 1, indicates that the USB trim is currently being updated (or is still starting up) and software should wait to read FREQTRIM. Update occurs at most once per millisecond.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>USBCLKADJ</name>
							<description>USB clock adjust mode.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>USBCLKADJ_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_USB_ADJUST</name>
									<description>Automatic USB rate adjustment mode. If the USB FS device peripheral is enabled and connected to a USB host, it provides clock adjustment information to the FRO based on SOF packets. USB rate adjustment requires a number of cycles to take place. the USBMODCHG bit (see below) indicates when initial adjustment is complete, and when later adjustments are in progress. software must not alter TRIM and FREQTRIM while USBCLKADJ = 1. see USBCLKADJ usage notes below this table.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FREQTRIM</name>
							<description>Frequency trim. Boot code configures this to a device-specific factory trim value for the 96 MHz FRO. If USBCLKADJ = 1, this field is read-only and provides the value resulting from USB rate adjustment. See the USBMODCFG flag regarding reading this field. Application code may adjust this field when USBCLKADJ = 0. A single step of FREQTRIM is roughly equivalent to 0.1% of the selected FRO frequency.</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved, only zero should be written.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Select the fro_hf output frequency. This bit can only be changed by software when the WRTRIM bit = 1. Note that the factory trim values are for the 96 MHz FRO only.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FRQ_48_MHZ</name>
									<description>48 MHz</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRQ_96_MHZ</name>
									<description>96 MHz</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIM</name>
							<description>This value is factory trimmed to account for bias and temperature compensation. The value should not be changed by software. Also see the WRTRIM bit description.</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTOSCCTRL</name>
					<description>Watchdog oscillator control</description>
					<addressOffset>0x508</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>10</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FREQSEL</name>
							<description>Frequency select. Selects the frequency of the oscillator. 0x00 = invalid setting when watchdog oscillator is running 0x01 = 0.4 MHz 0x02 = 0.6 MHz 0x03 = 0.75 MHz 0x04 = 0.9 MHz 0x05 = 1.0 MHz 0x06 = 1.2 MHz 0x07 = 1.3 MHz 0x08 = 1.4 MHz 0x09 = 1.5 MHz 0x0A = 1.6 MHz 0x0B = 1.7 MHz 0x0C = 1.8 MHz 0x0D = 1.9 MHz 0x0E = 2.0 MHz 0x0F = 2.05 MHz 0x10 = 2.1 MHz 0x11 = 2.2 MHz 0x12 = 2.25 MHz 0x13 = 2.3 MHz 0x14 = 2.4 MHz 0x15 = 2.45 MHz 0x16 = 2.5 MHz 0x17 = 2.6 MHz 0x18 = 2.65 MHz 0x19 = 2.7 MHz 0x1A = 2.8 MHz 0x1B = 2.85 MHz 0x1C = 2.9 MHz 0x1D = 2.95 MHz 0x1E = 3.0 MHz 0x1F = 3.05 MHz</description>
							<lsb>5</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVSEL</name>
							<description>Divider select. Selects the value of the divider that adjusts the output of the oscillator. 0x00 = divide by 2 0x01 = divide by 4 0x02 = divide by 6 up to 0x1E = divide by 62 0x1F = divide by 64</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTCOSCCTRL</name>
					<description>RTC oscillator 32 kHz output control</description>
					<addressOffset>0x50c</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>EN</name>
							<description>RTC 32 kHz clock enable.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>EN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. RTC clock off.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. RTC clock on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLCTRL</name>
					<description>PLL control</description>
					<addressOffset>0x580</addressOffset>
					<size>32</size>
					<resetValue>0x00008000</resetValue>
					<resetMask>0x001fffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>21</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DIRECTO</name>
							<description>PLL0 direct output enable.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIRECTO_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The PLL output divider (P divider) is used to create the PLL output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The PLL output divider (P divider) is bypassed, the PLL CCO output is used as the PLL output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIRECTI</name>
							<description>PLL0 direct input enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIRECTI_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The PLL input divider (N divider) output is used to drive the PLL CCO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The PLL input divider (N divider) is bypassed. the PLL input clock is used directly to drive the PLL CCO input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BANDSEL</name>
							<description>PLL filter control. Set this bit to one when the spread spectrum controller is disabled or at low frequencies. For spread spectrum mode: SEL_EXT = 0, BANDSEL = 0, and UPLIMOFF = 1.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BANDSEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>SSCG_CONTROL</name>
									<description>SSCG control. The PLL filter uses the parameters derived from the spread spectrum controller.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MDEC_CONTROL</name>
									<description>MDEC control. The PLL filter uses the programmable fields SELP, SELR, and SELI in this register to control the filter constants.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLIMOFF</name>
							<description>Disable upper frequency limiter.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>UPLIMOFF_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Upper frequency limiter disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BYPASSCCODIV2</name>
							<description>Bypass feedback clock divide by 2.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BYPASSCCODIV2_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DIVIDE_BY_2</name>
									<description>Divide by 2. The CCO feedback clock is divided by 2 in addition to the programmed M divide.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BYPASS</name>
									<description>Bypass. The CCO feedback clock is divided only by the programmed M divide.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BYPASS</name>
							<description>PLL bypass control.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BYPASS_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Bypass disabled. PLL CCO is sent to the PLL post-dividers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Bypass enabled. PLL input clock is sent to the PLL post-dividers (default).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELP</name>
							<description>Bandwidth select P value</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SELI</name>
							<description>Bandwidth select I value.</description>
							<lsb>4</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SELR</name>
							<description>Bandwidth select R value</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSTAT</name>
					<description>PLL status</description>
					<addressOffset>0x584</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LOCK</name>
							<description>PLL0 lock indicator</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLNDEC</name>
					<description>PLL N decoder</description>
					<addressOffset>0x588</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>11</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>NREQ</name>
							<description>NDEC reload request. When a 1 is written to this bit, the NDEC value is loaded into the PLL. Must be cleared by software for any subsequent load, or the PLL can be powered down and back up via the PDEN_SYS_PLL bit in the PDRUNCFG register if the NDEC value is changed.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDEC</name>
							<description>Decoded N-divider coefficient value.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLPDEC</name>
					<description>PLL P decoder</description>
					<addressOffset>0x58c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PREQ</name>
							<description>PDEC reload request. When a 1 is written to this bit, the PDEC value is loaded into the PLL. Must be cleared by software for any subsequent load, or the PLL can be powered down and back up via the PDEN_SYS_PLL bit in the PDRUNCFG register if the PDEC value is changed.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDEC</name>
							<description>Decoded P-divider coefficient value.</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSSCTRL0</name>
					<description>PLL spread spectrum control 0</description>
					<addressOffset>0x590</addressOffset>
					<size>32</size>
					<resetValue>0x00040000</resetValue>
					<resetMask>0x0007ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>19</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL_EXT</name>
							<description>Select spread spectrum mode. Selects the source of the feedback divider value. For normal mode, this must be the value from the MDEC field in this register. For spread spectrum mode: SEL_EXT = 0, BANDSEL = 0, and UPLIMOFF = 1.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MREQ</name>
							<description>MDEC reload request. When a 1 is written to this bit, the MDEC value is loaded into the PLL. Must be cleared by software for any subsequent load, or the PLL can be powered down and back up via the PDEN_SYS_PLL bit in the PDRUNCFG register if the MDEC value is changed.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MDEC</name>
							<description>Decoded M-divider coefficient value.</description>
							<lsb>0</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSPLLSSCTRL1</name>
					<description>PLL spread spectrum control 1</description>
					<addressOffset>0x594</addressOffset>
					<size>32</size>
					<resetValue>0x10000000</resetValue>
					<resetMask>0x3fffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DITHER</name>
							<description>Select modulation frequency.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DITHER_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FIXED</name>
									<description>Fixed. Fixed modulation frequency.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DITHER</name>
									<description>Dither. Randomly dither between two modulation frequencies.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD</name>
							<description>Spread spectrum power-down.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Spread spectrum controller is enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Spread spectrum controller is disabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MC</name>
							<description>Modulation waveform control. 0 = no compensation. Compensation for low pass filtering of the PLL to get a triangular modulation at the output of the PLL, giving a flat frequency spectrum. 0b00 =&amp;amp;gt; no compensation 0b10 =&amp;amp;gt; recommended setting 0b11 =&amp;amp;gt; max. compensation</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MR</name>
							<description>Programmable frequency modulation depth. 0 = no spread. _fmodpk-pk = Fref x k/Fcco = k/MDdec 0b000 =&amp;amp;gt; k = 0 (no spread spectrum) 0b001 =&amp;amp;gt; k _ 1 0b010 =&amp;amp;gt; k _ 1.5 0b011 =&amp;amp;gt; k _ 2 0b100 =&amp;amp;gt; k _ 3 0b101 =&amp;amp;gt; k _ 4 0b110 =&amp;amp;gt; k _ 6 0b111 =&amp;amp;gt; k _ 8</description>
							<lsb>23</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MF</name>
							<description>Programmable modulation frequency fm = Fref/Nss with Fref = Fin/N 0b000 =&amp;amp;gt; Nss = 512 (fm _ 3.9 - 7.8 kHz) 0b001 =&amp;amp;gt; Nss _ 384 (fm _ 5.2 - 10.4 kHz) 0b010 =&amp;amp;gt; Nss = 256 (fm _ 7.8 - 15.6 kHz) 0b011 =&amp;amp;gt; Nss = 128 (fm _ 15.6 - 31.3 kHz) 0b100 =&amp;amp;gt; Nss = 64 (fm _ 32.3 - 64.5 kHz) 0b101 =&amp;amp;gt; Nss = 32 (fm _ 62.5- 125 kHz) 0b110 =&amp;amp;gt; Nss _ 24 (fm _ 83.3- 166.6 kHz) 0b111 =&amp;amp;gt; Nss = 16 (fm _ 125- 250 kHz)</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MDREQ</name>
							<description>MD reload request. When a 1 is written to this bit, the MD value is loaded into the PLL. This bit is cleared when the load is complete</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MD</name>
							<description>M- divider value with fraction. MD[18:11]: integer portion of the feedback divider value. MD[10:0]: fractional portion of the feedback divider value. In fractional mode, fcco = (2 - BYPASSCCODIV2) x (MD x 2^-11) x Fref</description>
							<lsb>0</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
