cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>CPUCTRL</name>
					<description>CPU Control for multiple processors</description>
					<addressOffset>0x800</addressOffset>
					<size>32</size>
					<resetValue>0x0000004d</resetValue>
					<resetMask>0x0000007d</resetMask>
					<fields>
						<field>
							<name>reserved3</name>
							<description>Must be written as 0xC0C4 for the write to have an effect.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved2</name>
							<description>Must be written as a 1.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>7</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>POWERCPU</name>
							<description>Identifies the owner of reduced power mode control: which CPU can cause the device to enter Deep Sleep, Power-down, and Deep Power-down modes.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>POWERCPU_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>M0PL</name>
									<description>M0+. Cortex-M0+ is the owner of reduced power mode control.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>M4</name>
									<description>M4. Cortex-M4 is the owner of reduced power mode control.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM0RSTEN</name>
							<description>Cortex-M0+ reset.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CM0RSTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M0+ is not being reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M0+ is being reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM4RSTEN</name>
							<description>Cortex-M4 reset.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CM4RSTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M4 is not being reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M4 is being reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM0CLKEN</name>
							<description>Cortex-M0+ clock enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CM0CLKEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M0+ clock is not enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M0+ clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM4CLKEN</name>
							<description>Cortex-M4 clock enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CM4CLKEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Cortex-M4 clock is not enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Cortex-M4 clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MASTERCPU</name>
							<description>Indicates which CPU is considered the master. This is factory set assign the Cortex-M4 as the master. The master CPU cannot have its clock turned off via the related CMnCLKEN bit or be reset via the related CMxRSTEN in this register. The slave CPU wakes up briefly following device reset, then goes back to sleep until activated by the master CPU.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MASTERCPU_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>M0PL</name>
									<description>M0+. Cortex-M0+ is the master CPU.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>M4</name>
									<description>M4. Cortex-M4 is the master CPU.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CPBOOT</name>
					<description>Coprocessor Boot Address</description>
					<addressOffset>0x804</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOOTADDR</name>
							<description>Slave processor boot address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPSTACK</name>
					<description>Coprocessor Stack Address</description>
					<addressOffset>0x808</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STACKADDR</name>
							<description>Slave processor stack address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPSTAT</name>
					<description>Coprocessor Status</description>
					<addressOffset>0x80c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CM0LOCKUP</name>
							<description>When 1, the Cortex-M0+ CPU is in lockup.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CM4LOCKUP</name>
							<description>When 1, the Cortex-M4 CPU is in lockup</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CM0SLEEPING</name>
							<description>When 1, the Cortex-M0+ CPU is sleeping</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CM4SLEEPING</name>
							<description>When 1, the Cortex-M4 CPU is sleeping</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>JTAGIDCODE</name>
					<description>JTAG ID code register</description>
					<addressOffset>0xff4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>JTAGID</name>
							<description>JTAG ID code.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICE_ID0</name>
					<description>Part ID register</description>
					<addressOffset>0xff8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PARTID</name>
							<description>Part ID</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DEVICE_ID1</name>
					<description>Boot ROM and die revision register</description>
					<addressOffset>0xffc</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REVID</name>
							<description>Revision.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BODCTRL</name>
					<description>Brown-Out Detect control</description>
					<addressOffset>0x20044</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>BODINTSTAT</name>
							<description>BOD interrupt status. When 1, a BOD interrupt has occurred. Cleared by writing 1 to this bit.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BODRSTSTAT</name>
							<description>BOD reset status. When 1, a BOD reset has occurred. Cleared by writing 1 to this bit.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BODINTENA</name>
							<description>BOD interrupt enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BODINTENA_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable interrupt function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable interrupt function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODINTLEV</name>
							<description>BOD interrupt level</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BODINTLEV_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>LEVEL0</name>
									<description>Level 0: 2.05 V</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL1</name>
									<description>Level 1: 2.45 V</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL2</name>
									<description>Level 2: 2.75 V</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL3</name>
									<description>Level 3: 3.05 V</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODRSTENA</name>
							<description>BOD reset enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BODRSTENA_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable reset function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable reset function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BODRSTLEV</name>
							<description>BOD reset level</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>BODRSTLEV_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>LEVEL0</name>
									<description>Level 0: 1.5 V</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL1</name>
									<description>Level 1: 1.85 V</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL2</name>
									<description>Level 2: 2.0 V</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL3</name>
									<description>Level 3: 2.3 V</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCPRESETCTRL</name>
					<description>Async peripheral reset control</description>
					<addressOffset>0x40000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00006000</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>15</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CT32B4</name>
							<description>Standard counter/timer CT32B4 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT32B3</name>
							<description>Standard counter/timer CT32B3 reset control. 0 = Clear reset to this function. 1 = Assert reset to this function.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>0</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCPRESETCTRLSET</name>
					<description>Set bits in ASYNCPRESETCTRL</description>
					<addressOffset>0x40004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ARST_SET</name>
							<description>Writing ones to this register sets the corresponding bit or bits in the ASYNCPRESETCTRL register, if they are implemented. Bits that do not correspond to defined bits in ASYNCPRESETCTRL are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCPRESETCTRLCLR</name>
					<description>Clear bits in ASYNCPRESETCTRL</description>
					<addressOffset>0x40008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ARST_CLR</name>
							<description>Writing ones to this register clears the corresponding bit or bits in the ASYNCPRESETCTRL register, if they are implemented. Bits that do not correspond to defined bits in ASYNCPRESETCTRL are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKCTRL</name>
					<description>Async peripheral clock control</description>
					<addressOffset>0x40010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00006000</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>15</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CT32B4</name>
							<description>Controls the clock for CT32B4. 0 = Disable; 1 = Enable.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CT32B3</name>
							<description>Controls the clock for CT32B3. 0 = Disable; 1 = Enable.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>0</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKCTRLSET</name>
					<description>Set bits in ASYNCAPBCLKCTRL</description>
					<addressOffset>0x40014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ACLK_SET</name>
							<description>Writing ones to this register sets the corresponding bit or bits in the ASYNCAPBCLKCTRL register, if they are implemented. Bits that do not correspond to defined bits in ASYNCPRESETCTRL are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKCTRLCLR</name>
					<description>Clear bits in ASYNCAPBCLKCTRL</description>
					<addressOffset>0x40018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ACLK_CLR</name>
							<description>Writing ones to this register clears the corresponding bit or bits in the ASYNCAPBCLKCTRL register, if they are implemented. Bits that do not correspond to defined bits in ASYNCAPBCLKCTRL are reserved and only zeroes should be written to them.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASYNCAPBCLKSELA</name>
					<description>Async APB clock source select A</description>
					<addressOffset>0x40020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Clock source for asynchronous clock source selector A</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MAIN_CLOCK</name>
									<description>Main clock</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FRO_12_MHZ</name>
									<description>FRO 12 MHz</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED2</name>
									<description>Reserved setting</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED3</name>
									<description>Reserved setting</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
