cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>PIO0_30</name>
					<description>Digital I/O control for port 0 pins PIO0_30. These pins include an ADC input.</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<resetValue>0x00000190</resetValue>
					<resetMask>0x000005df</resetMask>
					<fields>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>11</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>OD</name>
							<description>Controls open-drain mode.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>OD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. Normal push-pull output</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. Simulated open-drain output (high drive disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FILTEROFF</name>
							<description>Controls input glitch filter.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>FILTEROFF_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Filter enabled. Noise pulses below approximately 10 ns are filtered out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Filter disabled. No input filtering is done.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGIMODE</name>
							<description>Select Analog/Digital mode.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIGIMODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ANALOG</name>
									<description>Analog mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL</name>
									<description>Digital mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INVERT</name>
							<description>Input polarity.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>INVERT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Input function is not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Input is function inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive. Inactive (no pull-down/pull-up resistor enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. Pull-down resistor enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. Pull-up resistor enabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. Repeater mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUNC</name>
							<description>Selects pin function.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIO0_31</name>
					<description>Digital I/O control for port 0 pins PIO0_31. These pins include an ADC input.</description>
					<addressOffset>0x7c</addressOffset>
					<size>32</size>
					<resetValue>0x00000190</resetValue>
					<resetMask>0x000005df</resetMask>
					<fields>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>11</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>OD</name>
							<description>Controls open-drain mode.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>OD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. Normal push-pull output</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. Simulated open-drain output (high drive disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FILTEROFF</name>
							<description>Controls input glitch filter.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>FILTEROFF_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Filter enabled. Noise pulses below approximately 10 ns are filtered out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Filter disabled. No input filtering is done.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGIMODE</name>
							<description>Select Analog/Digital mode.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIGIMODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ANALOG</name>
									<description>Analog mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL</name>
									<description>Digital mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INVERT</name>
							<description>Input polarity.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>INVERT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Input function is not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Input is function inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive. Inactive (no pull-down/pull-up resistor enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. Pull-down resistor enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. Pull-up resistor enabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. Repeater mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUNC</name>
							<description>Selects pin function.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>9</dim>
					<dimIncrement>4</dimIncrement>
					<dimIndex>0,1,2,3,4,5,6,7,8</dimIndex>
					<name>PIO1_[%s]</name>
					<description>Digital I/O control for port 1 pins PIO0_0 to PIO0_8. These pins include an ADC input.</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<resetValue>0x00000190</resetValue>
					<resetMask>0x000005df</resetMask>
					<fields>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>11</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>OD</name>
							<description>Controls open-drain mode.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>OD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. Normal push-pull output</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. Simulated open-drain output (high drive disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FILTEROFF</name>
							<description>Controls input glitch filter.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>FILTEROFF_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Filter enabled. Noise pulses below approximately 10 ns are filtered out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Filter disabled. No input filtering is done.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGIMODE</name>
							<description>Select Analog/Digital mode.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIGIMODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ANALOG</name>
									<description>Analog mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL</name>
									<description>Digital mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INVERT</name>
							<description>Input polarity.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>INVERT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Input function is not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Input is function inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive. Inactive (no pull-down/pull-up resistor enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. Pull-down resistor enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. Pull-up resistor enabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. Repeater mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUNC</name>
							<description>Selects pin function.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PIO1_9</name>
					<description>Digital I/O control for port 1 pins PIO1_9.</description>
					<addressOffset>0xa4</addressOffset>
					<size>32</size>
					<resetValue>0x00000190</resetValue>
					<resetMask>0x000007df</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>11</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>OD</name>
							<description>Controls open-drain mode.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>OD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal. Normal push-pull output</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN_DRAIN</name>
									<description>Open-drain. Simulated open-drain output (high drive disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEW</name>
							<description>Driver slew rate.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SLEW_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard mode, output slew rate control is enabled. More outputs can be switched simultaneously.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast mode, slew rate control is disabled. Refer to the appropriate specific device data sheet for details.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILTEROFF</name>
							<description>Controls input glitch filter.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>FILTEROFF_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Filter enabled. Noise pulses below approximately 10 ns are filtered out.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Filter disabled. No input filtering is done.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIGIMODE</name>
							<description>Select Analog/Digital mode.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DIGIMODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ANALOG</name>
									<description>Analog mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIGITAL</name>
									<description>Digital mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INVERT</name>
							<description>Input polarity.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>INVERT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Input function is not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Input is function inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Inactive. Inactive (no pull-down/pull-up resistor enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_DOWN</name>
									<description>Pull-down. Pull-down resistor enabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_UP</name>
									<description>Pull-up. Pull-up resistor enabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEATER</name>
									<description>Repeater. Repeater mode.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUNC</name>
							<description>Selects pin function.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
