cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GINT0</name>
			<version>1.0</version>
			<description>LPC5411x Group GPIO input interrupt (GINT0/1)</description>
			<groupName>gint</groupName>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x48</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL</name>
					<description>GPIO grouped interrupt control register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>TRIG</name>
							<description>Group interrupt trigger</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>TRIG_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>EDGE_TRIGGERED</name>
									<description>Edge-triggered.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LEVEL_TRIGGERED</name>
									<description>Level-triggered.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COMB</name>
							<description>Combine enabled inputs for group interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>COMB_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>OR</name>
									<description>Or. OR functionality: A grouped interrupt is generated when any one of the enabled inputs is active (based on its programmed polarity).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AND</name>
									<description>And. AND functionality: An interrupt is generated when all enabled bits are active (based on their programmed polarity).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT</name>
							<description>Group interrupt status. This bit is cleared by writing a one to it. Writing zero has no effect.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>INT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_REQUEST</name>
									<description>No request. No interrupt request is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REQUEST_ACTIVE</name>
									<description>Request active. Interrupt request is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_POL0</name>
					<description>GPIO grouped interrupt port 0 polarity register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>POL</name>
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_POL1</name>
					<description>GPIO grouped interrupt port 1 polarity register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>POL</name>
							<description>Configure pin polarity of port m pins for group interrupt. Bit n corresponds to pin PIOm_n of port m. 0 = the pin is active LOW. If the level on this pin is LOW, the pin contributes to the group interrupt. 1 = the pin is active HIGH. If the level on this pin is HIGH, the pin contributes to the group interrupt.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_ENA0</name>
					<description>GPIO grouped interrupt port 0 enable register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENA</name>
							<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_ENA1</name>
					<description>GPIO grouped interrupt port 1 enable register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENA</name>
							<description>Enable port 0 pin for group interrupt. Bit n corresponds to pin Pm_n of port m. 0 = the port 0 pin is disabled and does not contribute to the grouped interrupt. 1 = the port 0 pin is enabled and contributes to the grouped interrupt.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
