cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PINT</name>
			<version>1.0</version>
			<description>LPC5411x Pin interrupt and pattern match (PINT)</description>
			<groupName>pint</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x34</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ISEL</name>
					<description>Pin Interrupt Mode register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PMODE</name>
							<description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IENR</name>
					<description>Pin interrupt level or rising edge interrupt enable register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ENRL</name>
							<description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIENR</name>
					<description>Pin interrupt level or rising edge interrupt set register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SETENRL</name>
							<description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CIENR</name>
					<description>Pin interrupt level (rising edge interrupt) clear register</description>
					<addressOffset>0xc</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CENRL</name>
							<description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IENF</name>
					<description>Pin interrupt active level or falling edge interrupt enable register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ENAF</name>
							<description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIENF</name>
					<description>Pin interrupt active level or falling edge interrupt set register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SETENAF</name>
							<description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CIENF</name>
					<description>Pin interrupt active level or falling edge interrupt clear register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CENAF</name>
							<description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RISE</name>
					<description>Pin interrupt rising edge register</description>
					<addressOffset>0x1c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>RDET</name>
							<description>Rising edge detect. Bit n detects the rising edge of the pin selected in PINTSELn. Read 0: No rising edge has been detected on this pin since Reset or the last time a one was written to this bit. Write 0: no operation. Read 1: a rising edge has been detected since Reset or the last time a one was written to this bit. Write 1: clear rising edge detection for this pin.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FALL</name>
					<description>Pin interrupt falling edge register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FDET</name>
							<description>Falling edge detect. Bit n detects the falling edge of the pin selected in PINTSELn. Read 0: No falling edge has been detected on this pin since Reset or the last time a one was written to this bit. Write 0: no operation. Read 1: a falling edge has been detected since Reset or the last time a one was written to this bit. Write 1: clear falling edge detection for this pin.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IST</name>
					<description>Pin interrupt status register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PSTAT</name>
							<description>Pin interrupt status. Bit n returns the status, clears the edge interrupt, or inverts the active level of the pin selected in PINTSELn. Read 0: interrupt is not being requested for this interrupt pin. Write 0: no operation. Read 1: interrupt is being requested for this interrupt pin. Write 1 (edge-sensitive): clear rising- and falling-edge detection for this pin. Write 1 (level-sensitive): switch the active level for this pin (in the IENF register).</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCTRL</name>
					<description>Pattern match interrupt control register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xff000003</resetMask>
					<fields>
						<field>
							<name>PMAT</name>
							<description>This field displays the current state of pattern matches. A 1 in any bit of this field indicates that the corresponding product term is matched by the current state of the appropriate inputs.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Do not write 1s to unused bits.</description>
							<lsb>2</lsb>
							<msb>23</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ENA_RXEV</name>
							<description>Enables the RXEV output to the CPU and/or to a GPIO output when the specified boolean expression evaluates to true.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ENA_RXEV_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. RXEV output to the CPU is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. RXEV output to the CPU is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEL_PMATCH</name>
							<description>Specifies whether the 8 pin interrupts are controlled by the pin interrupt function or by the pattern match function.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEL_PMATCH_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>PIN_INTERRUPT</name>
									<description>Pin interrupt. Interrupts are driven in response to the standard pin interrupt function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PATTERN_MATCH</name>
									<description>Pattern match. Interrupts are driven in response to pattern matches.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
