cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>PMSRC</name>
					<description>Pattern match interrupt bit-slice source register</description>
					<addressOffset>0x2c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffff00</resetMask>
					<fields>
						<field>
							<name>SRC7</name>
							<description>Selects the input source for bit slice 7</description>
							<lsb>29</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC7_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 7.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 7.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 7.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 7.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 7.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 7.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 7.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 7.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC6</name>
							<description>Selects the input source for bit slice 6</description>
							<lsb>26</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC6_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 6.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 6.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 6.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 6.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 6.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 6.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 6.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC5</name>
							<description>Selects the input source for bit slice 5</description>
							<lsb>23</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC5_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 5.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 5.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 5.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 5.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 5.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 5.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 5.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC4</name>
							<description>Selects the input source for bit slice 4</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC4_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 4.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 4.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 4.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 4.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 4.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 4.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 4.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC3</name>
							<description>Selects the input source for bit slice 3</description>
							<lsb>17</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC3_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 3.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 3.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 3.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 3.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 3.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 3.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC2</name>
							<description>Selects the input source for bit slice 2</description>
							<lsb>14</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC2_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 2.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 2.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 2.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 2.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 2.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 2.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC1</name>
							<description>Selects the input source for bit slice 1</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC1_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 1.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 1.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 1.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 1.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 1.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 1.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC0</name>
							<description>Selects the input source for bit slice 0</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SRC0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INPUT0</name>
									<description>Input 0. Selects the pin selected in the PINTSEL0 register as the source to bit slice 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT1</name>
									<description>Input 1. Selects the pin selected in the PINTSEL1 register as the source to bit slice 0.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT2</name>
									<description>Input 2. Selects the pin selected in the PINTSEL2 register as the source to bit slice 0.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT3</name>
									<description>Input 3. Selects the pin selected in the PINTSEL3 register as the source to bit slice 0.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT4</name>
									<description>Input 4. Selects the pin selected in the PINTSEL4 register as the source to bit slice 0.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT5</name>
									<description>Input 5. Selects the pin selected in the PINTSEL5 register as the source to bit slice 0.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT6</name>
									<description>Input 6. Selects the pin selected in the PINTSEL6 register as the source to bit slice 0.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT7</name>
									<description>Input 7. Selects the pin selected in the PINTSEL7 register as the source to bit slice 0.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Software should not write 1s to unused bits.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
