cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
									<description>Event. Non-sticky rising or falling edge. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of value 0x3) . This bit is cleared after one clock cycle.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Bit slice 7 is automatically considered a product end point.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PROD_ENDPTS6</name>
							<description>Determines whether slice 6 is an endpoint.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS6_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 6 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 6 is the endpoint of a product term (minterm). Pin interrupt 6 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD_ENDPTS5</name>
							<description>Determines whether slice 5 is an endpoint.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS5_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 5 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 5 is the endpoint of a product term (minterm). Pin interrupt 5 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD_ENDPTS4</name>
							<description>Determines whether slice 4 is an endpoint.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS4_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 4 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 4 is the endpoint of a product term (minterm). Pin interrupt 4 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD_ENDPTS3</name>
							<description>Determines whether slice 3 is an endpoint.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS3_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 3 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 3 is the endpoint of a product term (minterm). Pin interrupt 3 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD_ENDPTS2</name>
							<description>Determines whether slice 2 is an endpoint.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS2_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 2 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 2 is the endpoint of a product term (minterm). Pin interrupt 2 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD_ENDPTS1</name>
							<description>Determines whether slice 1 is an endpoint.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS1_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 1 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 1 is the endpoint of a product term (minterm). Pin interrupt 1 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD_ENDPTS0</name>
							<description>Determines whether slice 0 is an endpoint.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PROD_ENDPTS0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect. Slice 0 is not an endpoint.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT</name>
									<description>endpoint. Slice 0 is the endpoint of a product term (minterm). Pin interrupt 0 in the NVIC is raised if the minterm evaluates as true.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
