cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>WWDT</name>
			<version>1.0</version>
			<description>LPC5411x Windowed Watchdog Timer (WWDT)</description>
			<groupName>wwdt</groupName>
			<baseAddress>0x4000c000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1c</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MOD</name>
					<description>Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer.</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>6</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>Once this bit is set to one and a watchdog feed is performed, disabling or powering down the watchdog oscillator is prevented by hardware. This bit can be set once by software and is only cleared by any reset.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WDPROTECT</name>
							<description>Watchdog update mode. This bit can be set once by software and is only cleared by a reset.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WDPROTECT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FLEXIBLE</name>
									<description>Flexible. The watchdog time-out value (TC) can be changed at any time.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THRESHOLD</name>
									<description>Threshold. The watchdog time-out value (TC) can be changed only after the counter is below the value of WDWARNINT and WDWINDOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDINT</name>
							<description>Warning interrupt flag. Set when the timer is at or below the value in WDWARNINT. Cleared by software writing a 1 to this bit position. Note that this bit cannot be cleared while the WARNINT value is equal to the value of the TV register. This can occur if the value of WARNINT is 0 and the WDRESET bit is 0 when TV decrements to 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WDTOF</name>
							<description>Watchdog time-out flag. Set when the watchdog timer times out, by a feed error, or by events associated with WDPROTECT. Cleared by software writing a 0 to this bit position. Causes a chip reset if WDRESET = 1.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WDRESET</name>
							<description>Watchdog reset enable bit. Once this bit has been written with a 1 it cannot be re-written with a 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WDRESET_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INTERRUPT</name>
									<description>Interrupt. A watchdog time-out will not cause a chip reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset. A watchdog time-out will cause a chip reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDEN</name>
							<description>Watchdog enable bit. Once this bit is set to one and a watchdog feed is performed, the watchdog timer will run permanently.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WDEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop. The watchdog timer is stopped.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The watchdog timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TC</name>
					<description>Watchdog timer constant register. This 24-bit register determines the time-out value.</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<resetValue>0x000000ff</resetValue>
					<resetMask>0x00ffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>COUNT</name>
							<description>Watchdog time-out value.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FEED</name>
					<description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in TC.</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FEED</name>
							<description>Feed value should be 0xAA followed by 0x55.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TV</name>
					<description>Watchdog timer value register. This 24-bit register reads out the current value of the Watchdog timer.</description>
					<addressOffset>0xc</addressOffset>
					<size>32</size>
					<resetValue>0x000000ff</resetValue>
					<resetMask>0x00ffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>COUNT</name>
							<description>Counter timer value.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>reserved0</name>
					<description>Reserved</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WARNINT</name>
					<description>Watchdog Warning Interrupt compare value.</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000003ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved, only zero should be written.</description>
							<lsb>10</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>WARNINT</name>
							<description>Watchdog warning interrupt compare value.</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WINDOW</name>
					<description>Watchdog Window compare value.</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00ffffff</resetValue>
					<resetMask>0x00ffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved, only zero should be written.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>WINDOW</name>
							<description>Watchdog window value.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
