cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>UTICK</name>
			<version>1.0</version>
			<description>LPC5411x Micro-tick Timer (UTICK)</description>
			<groupName>utick</groupName>
			<baseAddress>0x4000e000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL</name>
					<description>Control register.</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REPEAT</name>
							<description>Repeat delay. 0 = One-time delay. 1 = Delay repeats continuously.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DELAYVAL</name>
							<description>Tick interval value. The delay will be equal to DELAYVAL + 1 periods of the timer clock. The minimum usable value is 1, for a delay of 2 timer clocks. A value of 0 stops the timer.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>Status register.</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ACTIVE</name>
							<description>Active flag. 0 = The Micro-Tick Timer is stopped. 1 = The Micro-Tick Timer is currently active.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTR</name>
							<description>Interrupt flag. 0 = No interrupt is pending. 1 = An interrupt is pending. A write of any value to this register clears this flag.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CFG</name>
					<description>Capture configuration register.</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000f0f</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved</description>
							<lsb>12</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPPOL3</name>
							<description>Capture Polarity 3. 0 = Positive edge capture, 1 = Negative edge capture.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPPOL2</name>
							<description>Capture Polarity 2. 0 = Positive edge capture, 1 = Negative edge capture.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPPOL1</name>
							<description>Capture Polarity 1. 0 = Positive edge capture, 1 = Negative edge capture.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPPOL0</name>
							<description>Capture Polarity 0. 0 = Positive edge capture, 1 = Negative edge capture.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPEN3</name>
							<description>Enable Capture 3. 1 = Enabled, 0 = Disabled.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPEN2</name>
							<description>Enable Capture 2. 1 = Enabled, 0 = Disabled.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPEN1</name>
							<description>Enable Capture 1. 1 = Enabled, 0 = Disabled.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPEN0</name>
							<description>Enable Capture 0. 1 = Enabled, 0 = Disabled.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAPCLR</name>
					<description>Capture clear register.</description>
					<addressOffset>0xc</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPCLR3</name>
							<description>Clear capture 3. Writing 1 to this bit clears the CAP3 register value.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPCLR2</name>
							<description>Clear capture 2. Writing 1 to this bit clears the CAP2 register value.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPCLR1</name>
							<description>Clear capture 1. Writing 1 to this bit clears the CAP1 register value.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CAPCLR0</name>
							<description>Clear capture 0. Writing 1 to this bit clears the CAP0 register value.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<dimIndex>0,1,2,3</dimIndex>
					<name>CAP[%s]</name>
					<description>Capture register .</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VALID</name>
							<description>Capture Valid. When 1, a value has been captured based on a transition of the related UTICK_CAPn pin. Cleared by writing to the related bit in the CAPCLR register.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CAP_VALUE</name>
							<description>Capture value for the related capture event (UTICK_CAPn. Note: the value is 1 lower than the actual value of the Micro-tick Timer at the moment of the capture event.</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
