cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>EMR</name>
					<description>External Match Register. The EMR controls the match function and the external match pins.</description>
					<addressOffset>0x3c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000fff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>12</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>EMC3</name>
							<description>External Match Control 3. Determines the functionality of External Match 3.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>EMC3_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match bit/output to 0 (MAT3 pin is LOW if pinned out).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match bit/output to 1 (MAT3 pin is HIGH if pinned out).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match bit/output.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC2</name>
							<description>External Match Control 2. Determines the functionality of External Match 2.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>EMC2_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match bit/output to 0 (MAT2 pin is LOW if pinned out).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match bit/output to 1 (MAT2 pin is HIGH if pinned out).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match bit/output.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC1</name>
							<description>External Match Control 1. Determines the functionality of External Match 1.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>EMC1_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match bit/output to 0 (MAT1 pin is LOW if pinned out).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match bit/output to 1 (MAT1 pin is HIGH if pinned out).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match bit/output.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC0</name>
							<description>External Match Control 0. Determines the functionality of External Match 0.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>EMC0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DO_NOTHING</name>
									<description>Do Nothing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Clear. Clear the corresponding External Match bit/output to 0 (MAT0 pin is LOW if pinned out).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Set. Set the corresponding External Match bit/output to 1 (MAT0 pin is HIGH if pinned out).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE</name>
									<description>Toggle. Toggle the corresponding External Match bit/output.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EM3</name>
							<description>External Match 3. This bit reflects the state of output MAT3, whether or not this output is connected to a pin. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing, as selected by MR[11:10]. This bit is driven to the MAT pins if the match function is selected via IOCON. 0 = LOW. 1 = HIGH.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EM2</name>
							<description>External Match 2. This bit reflects the state of output MAT2, whether or not this output is connected to a pin. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing, as selected by EMR[9:8]. This bit is driven to the MAT pins if the match function is selected via IOCON. 0 = LOW. 1 = HIGH.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EM1</name>
							<description>External Match 1. This bit reflects the state of output MAT1, whether or not this output is connected to a pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing, as selected by EMR[7:6]. This bit is driven to the MAT pins if the match function is selected via IOCON. 0 = LOW. 1 = HIGH.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EM0</name>
							<description>External Match 0. This bit reflects the state of output MAT0, whether or not this output is connected to a pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing, as selected by EMR[5:4]. This bit is driven to the MAT pins if the match function is selected via IOCON. 0 = LOW. 1 = HIGH.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTCR</name>
					<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SELCC</name>
							<description>Edge select. When bit 4 is 1, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is low. Values 0x2 to 0x3 and 0x6 to 0x7 are reserved.</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SELCC_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>CHANNEL_0_RISING</name>
									<description>Channel 0 Rising Edge. Rising edge of the signal on capture channel 0 clears the timer (if bit 4 is set).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_0_FALLING</name>
									<description>Channel 0 Falling Edge. Falling edge of the signal on capture channel 0 clears the timer (if bit 4 is set).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_1_RISING</name>
									<description>Channel 1 Rising Edge. Rising edge of the signal on capture channel 1 clears the timer (if bit 4 is set).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_1_FALLING</name>
									<description>Channel 1 Falling Edge. Falling edge of the signal on capture channel 1 clears the timer (if bit 4 is set).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_2_RISING</name>
									<description>Channel 2 Rising Edge. Rising edge of the signal on capture channel 2 clears the timer (if bit 4 is set).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_2_FALLING</name>
									<description>Channel 2 Falling Edge. Falling edge of the signal on capture channel 2 clears the timer (if bit 4 is set).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENCC</name>
							<description>Setting this bit to 1 enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CINSEL</name>
							<description>Count Input Select When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking. Note: If Counter mode is selected for a particular CAPn input in the CTCR, the 3 bits for that input in the Capture Control Register (CCR) must be programmed as 000. However, capture and/or interrupt can be selected for the other 3 CAPn inputs in the same timer.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CINSEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>CHANNEL_0</name>
									<description>Channel 0. CAPn.0 for CT32Bn</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_1</name>
									<description>Channel 1. CAPn.1 for CT32Bn</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_2</name>
									<description>Channel 2. CAPn.2 for CT32Bn</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANNEL_3</name>
									<description>Channel 3. CAPn.3 for CT32Bn</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTMODE</name>
							<description>Counter/Timer Mode This field selects which rising APB bus clock edges can increment Timer'&#128;&#153;s Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: the TC is incremented when the Prescale Counter matches the Prescale Register.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CTMODE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>TIMER</name>
									<description>Timer Mode. Incremented every rising APB bus clock edge.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_RISING_EDGE</name>
									<description>Counter Mode rising edge. TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_FALLING_EDGE</name>
									<description>Counter Mode falling edge. TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_DUAL_EDGE</name>
									<description>Counter Mode dual edge. TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMC</name>
					<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins.</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PWMEN3</name>
							<description>PWM mode enable for channel3. Note: It is recommended to use match channel 3 to set the PWM cycle.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PWMEN3_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT3 is controlled by EM3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for CT132Bn_MAT3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN2</name>
							<description>PWM mode enable for channel2.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PWMEN2_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT2 is controlled by EM2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for CT32Bn_MAT2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN1</name>
							<description>PWM mode enable for channel1.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PWMEN1_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT01 is controlled by EM1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for CT32Bn_MAT1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN0</name>
							<description>PWM mode enable for channel0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PWMEN0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. CT32Bn_MAT0 is controlled by EM0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM</name>
									<description>PWM. PWM mode is enabled for CT32Bn_MAT0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
