cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<version>1.0</version>
			<description>LPC5411x Real-Time Clock (RTC)</description>
			<groupName>rtc</groupName>
			<baseAddress>0x4002c000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL</name>
					<description>RTC control register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x000003fd</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>10</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>RTC_OSC_BYPASS</name>
							<description>RTC oscillator bypass control.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>RTC_OSC_BYPASS_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>RTC oscillator is in normal crystal oscillation mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BYPASSED</name>
									<description>RTC oscillator is bypassed. RTCXIN may be driven by an external clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC_OSC_PD</name>
							<description>RTC oscillator power-down control.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>RTC_OSC_PD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>POWER_UP</name>
									<description>See RTC_OSC_BYPASS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERED_DOWN</name>
									<description>RTC oscillator is powered-down.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC_EN</name>
							<description>RTC enable.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>RTC_EN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. The RTC 1 Hz and 1 kHz clocks are shut down and the RTC operation is disabled. This bit should be 0 when writing to load a value in the RTC counter register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The 1 Hz RTC clock is running and RTC operation is enabled. This bit must be set to initiate operation of the RTC. The first clock to the RTC counter occurs 1 s after this bit is set. To also enable the high-resolution, 1 kHz clock, set bit 6 in this register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC1KHZ_EN</name>
							<description>RTC 1 kHz clock enable. This bit can be set to 0 to conserve power if the 1 kHz timer is not used. This bit has no effect when the RTC is disabled (bit 7 of this register is 0).</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>RTC1KHZ_EN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 kHz RTC timer will not bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. The 1 kHz RTC timer is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEDPD_EN</name>
							<description>RTC 1 kHz timer wake-up enable for Deep power-down.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WAKEDPD_EN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 kHz RTC timer will not bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A match on the 1 kHz RTC timer bring the part out of Deep power-down mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARMDPD_EN</name>
							<description>RTC 1 Hz timer alarm enable for Deep power-down.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ALARMDPD_EN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable. A match on the 1 Hz RTC timer will not bring the part out of Deep power-down mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable. A match on the 1 Hz RTC timer bring the part out of Deep power-down mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKE1KHZ</name>
							<description>RTC 1 kHz timer wake-up flag status.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WAKE1KHZ_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>RUN</name>
									<description>Run. The RTC 1 kHz timer is running. Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMEOUT</name>
									<description>Time-out. The 1 kHz high-resolution/wake-up timer has timed out. This flag generates an RTC wake-up interrupt request RTC-WAKE which can also wake up the part from any low power mode. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALARM1HZ</name>
							<description>RTC 1 Hz timer alarm flag status.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ALARM1HZ_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_MATCH</name>
									<description>No match. No match has occurred on the 1 Hz RTC timer. Writing a 0 has no effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MATCH</name>
									<description>Match. A match condition has occurred on the 1 Hz RTC timer. This flag generates an RTC alarm interrupt request RTC_ALARM which can also wake up the part from any low power mode. Writing a 1 clears this bit.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SWRESET</name>
							<description>Software reset control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SWRESET_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NOT_IN_RESET</name>
									<description>Not in reset. The RTC is not held in reset. This bit must be cleared prior to configuring or initiating any operation of the RTC.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IN_RESET</name>
									<description>In reset. The RTC is held in reset. All register bits within the RTC will be forced to their reset value except the OFD bit. This bit must be cleared before writing to any register in the RTC - including writes to set any of the other bits within this register. Do not attempt to write to any bits of this register at the same time that the reset bit is being cleared.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH</name>
					<description>RTC match register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATVAL</name>
							<description>Contains the match value against which the 1 Hz RTC timer will be compared to set the alarm flag RTC_ALARM and generate an alarm interrupt/wake-up if enabled.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>RTC counter register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VAL</name>
							<description>A read reflects the current value of the main, 1 Hz RTC timer. A write loads a new initial value into the timer. The RTC counter will count up continuously at a 1 Hz rate once the RTC Software Reset is removed (by clearing bit 0 of the CTRL register). Only write to this register when the RTC_EN bit in the RTC CTRL Register is 0. The counter increments one second after the RTC_EN bit is set.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE</name>
					<description>High-resolution/wake-up timer control register</description>
					<addressOffset>0xc</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>VAL</name>
							<description>A read reflects the current value of the high-resolution/wake-up timer. A write pre-loads a start count value into the wake-up timer and initializes a count-down sequence. Do not write to this register while counting is in progress.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
