cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>INPUT</name>
					<description>SCT input register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIN15</name>
							<description>Input 15 state. Input 15 state following the synchronization specified by INSYNC.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN14</name>
							<description>Input 14 state. Input 14 state following the synchronization specified by INSYNC.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN13</name>
							<description>Input 13 state. Input 13 state following the synchronization specified by INSYNC.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN12</name>
							<description>Input 12 state. Input 12 state following the synchronization specified by INSYNC.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN11</name>
							<description>Input 11 state. Input 11 state following the synchronization specified by INSYNC.</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN10</name>
							<description>Input 10 state. Input 10 state following the synchronization specified by INSYNC.</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN9</name>
							<description>Input 9 state. Input 9 state following the synchronization specified by INSYNC.</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN8</name>
							<description>Input 8 state. Input 8 state following the synchronization specified by INSYNC.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN7</name>
							<description>Input 7 state. Input 7 state following the synchronization specified by INSYNC.</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN6</name>
							<description>Input 6 state. Input 6 state following the synchronization specified by INSYNC.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN5</name>
							<description>Input 5 state. Input 5 state following the synchronization specified by INSYNC.</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN4</name>
							<description>Input 4 state. Input 4 state following the synchronization specified by INSYNC.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN3</name>
							<description>Input 3 state. Input 3 state following the synchronization specified by INSYNC.</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN2</name>
							<description>Input 2 state. Input 2 state following the synchronization specified by INSYNC.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN1</name>
							<description>Input 1 state. Input 1 state following the synchronization specified by INSYNC.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SIN0</name>
							<description>Input 0 state. Input 0 state following the synchronization specified by INSYNC.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN15</name>
							<description>Input 15 state. Input 15 state on the last SCT clock edge.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN14</name>
							<description>Input 14 state. Input 14 state on the last SCT clock edge.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN13</name>
							<description>Input 13 state. Input 13 state on the last SCT clock edge.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN12</name>
							<description>Input 12 state. Input 12 state on the last SCT clock edge.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN11</name>
							<description>Input 11 state. Input 11 state on the last SCT clock edge.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN10</name>
							<description>Input 10 state. Input 10 state on the last SCT clock edge.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN9</name>
							<description>Input 9 state. Input 9 state on the last SCT clock edge.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN8</name>
							<description>Input 8 state. Input 8 state on the last SCT clock edge.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN7</name>
							<description>Input 7 state. Input 7 state on the last SCT clock edge.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN6</name>
							<description>Input 6 state. Input 6 state on the last SCT clock edge.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN5</name>
							<description>Input 5 state. Input 5 state on the last SCT clock edge.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN4</name>
							<description>Input 4 state. Input 4 state on the last SCT clock edge.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN3</name>
							<description>Input 3 state. Input 3 state on the last SCT clock edge.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN2</name>
							<description>Input 2 state. Input 2 state on the last SCT clock edge.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN1</name>
							<description>Input 1 state. Input 1 state on the last SCT clock edge.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AIN0</name>
							<description>Input 0 state. Input 0 state on the last SCT clock edge.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REGMODE</name>
					<description>SCT match/capture mode register</description>
					<addressOffset>0x4c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REGMOD_H</name>
							<description>Each bit controls one match/capture register (register 0 = bit 16, register 1 = bit 17, etc.). The number of bits = number of match/captures in this SCT. 0 = register operates as match registers. 1 = register operates as capture registers.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REGMOD_L</name>
							<description>Each bit controls one match/capture register (register 0 = bit 0, register 1 = bit 1, etc.). The number of bits = number of match/captures in this SCT. 0 = register operates as match register. 1 = register operates as capture register.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTPUT</name>
					<description>SCT output register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>OUT</name>
							<description>Writing a 1 to bit n forces the corresponding output HIGH. Writing a 0 forces the corresponding output LOW (output 0 = bit 0, output 1 = bit 1, etc.). The number of bits = number of outputs in this SCT.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
