cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>OUTPUTDIRCTRL</name>
					<description>SCT output counter direction control register</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SETCLR15</name>
							<description>Set/clear operation on output 15. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR15_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR14</name>
							<description>Set/clear operation on output 14. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR14_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR13</name>
							<description>Set/clear operation on output 13. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR13_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR12</name>
							<description>Set/clear operation on output 12. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR12_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR11</name>
							<description>Set/clear operation on output 11. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR11_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR10</name>
							<description>Set/clear operation on output 10. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR10_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR9</name>
							<description>Set/clear operation on output 9. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR9_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR8</name>
							<description>Set/clear operation on output 8. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR8_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR7</name>
							<description>Set/clear operation on output 7. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR7_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR6</name>
							<description>Set/clear operation on output 6. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR6_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR5</name>
							<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR5_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR4</name>
							<description>Set/clear operation on output 4. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR4_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR3</name>
							<description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR3_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR2</name>
							<description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR2_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR1</name>
							<description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR1_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SETCLR0</name>
							<description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SETCLR0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>INDEPENDENT</name>
									<description>Set and clear do not depend on the direction of any counter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>L_REVERSED</name>
									<description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>H_REVERSED</name>
									<description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
