cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>CONEN</name>
					<description>SCT conflict interrupt enable register</description>
					<addressOffset>0xf8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>NCEN</name>
							<description>The SCT requests an interrupt when bit n of this register and the SCT conflict flag register are both one (output 0 = bit 0, output 1 = bit 1, etc.). The number of bits = number of outputs in this SCT.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFLAG</name>
					<description>SCT conflict flag register</description>
					<addressOffset>0xfc</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xc000ffff</resetMask>
					<fields>
						<field>
							<name>BUSERRH</name>
							<description>The most recent bus error from this SCT involved writing CTR H, STATE H, MATCH H, or the Output register when the H counter was not halted.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BUSERRL</name>
							<description>The most recent bus error from this SCT involved writing CTR L/Unified, STATE L/Unified, MATCH L/Unified, or the Output register when the L/U counter was not halted. A word write to certain L and H registers can be half successful and half unsuccessful.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>NCFLAG</name>
							<description>Bit n is one if a no-change conflict event occurred on output n since reset or a 1 was last written to this bit (output 0 = bit 0, output 1 = bit 1, etc.). The number of bits = number of outputs in this SCT.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH0</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP0</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH1</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP1</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH2</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP2</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH3</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x10c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP3</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x10c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH4</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP4</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH5</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP5</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH6</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP6</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH7</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x11c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP7</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x11c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH8</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP8</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MATCH9</name>
					<description>SCT match value register of match channels</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MATCHn_H</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the H counter. When UNIFY = 1, read or write the upper 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MATCHn_L</name>
							<description>When UNIFY = 0, read or write the 16-bit value to be compared to the L counter. When UNIFY = 1, read or write the lower 16 bits of the 32-bit value to be compared to the unified counter.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAP9</name>
					<description>SCT capture register of capture channel</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CAPn_H</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the upper 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CAPn_L</name>
							<description>When UNIFY = 0, read the 16-bit counter value at which this register was last captured. When UNIFY = 1, read the lower 16 bits of the 32-bit value at which this register was last captured.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
