cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>ID</name>
					<description>SPI module Identification. This value appears in the shared Flexcomm peripheral ID register when SPI is selected.</description>
					<addressOffset>0xffc</addressOffset>
					<size>32</size>
					<resetValue>0xe0200000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>Unique module identifier for this IP block.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MAJOR_REV</name>
							<description>Major revision of module implementation, starting at 0. There may not be software compatibility between major revisions.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MINOR_REV</name>
							<description>Minor revision of module implementation, starting at 0. Minor revision of module implementation, starting at 0. Software compatibility is expected between minor revisions.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>APERTURE</name>
							<description>Aperture: encoded as (aperture size/4K) -1, so 0x00 means a 4K aperture.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>I2C1</name>
			<version>1.0</version>
			<description>LPC5411x I2C-bus interfaces</description>
			<groupName>i2c</groupName>
			<baseAddress>0x40087000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CFG</name>
					<description>Configuration for shared functions.</description>
					<addressOffset>0x800</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000003f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>6</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HSCAPABLE</name>
							<description>High-speed mode Capable enable. Since High Speed mode alters the way I2C pins drive and filter, as well as the timing for certain I2C signalling, enabling High-speed mode applies to all functions: Master, Slave, and Monitor.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>HSCAPABLE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FAST_MODE_PLUS</name>
									<description>Fast-mode plus. The I 2C interface will support Standard-mode, Fast-mode, and Fast-mode Plus, to the extent that the pin electronics support these modes. Any changes that need to be made to the pin controls, such as changing the drive strength or filtering, must be made by software via the IOCON register associated with each I2C pin,</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED</name>
									<description>High-speed. In addition to Standard-mode, Fast-mode, and Fast-mode Plus, the I 2C interface will support High-speed mode to the extent that the pin electronics support these modes. See Section 25.7.2.2 for more information.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONCLKSTR</name>
							<description>Monitor function Clock Stretching.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MONCLKSTR_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The Monitor function will not perform clock stretching. Software or DMA may not always be able to read data provided by the Monitor function before it is overwritten. This mode may be used when non-invasive monitoring is critical.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The Monitor function will perform clock stretching in order to ensure that software or DMA can read all incoming data supplied by the Monitor function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMEOUTEN</name>
							<description>I2C bus Time-out Enable. When disabled, the time-out function is internally reset.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>TIMEOUTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. Time-out function is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Time-out function is enabled. Both types of time-out flags will be generated and will cause interrupts if they are enabled. Typically, only one time-out will be used in a system.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONEN</name>
							<description>Monitor Enable. When disabled, configurations settings for the Monitor function are not changed, but the Monitor function is internally reset.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MONEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The I2C Monitor function is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The I2C Monitor function is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVEN</name>
							<description>Slave Enable. When disabled, configurations settings for the Slave function are not changed, but the Slave function is internally reset.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SLVEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The I2C slave function is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The I2C slave function is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTEN</name>
							<description>Master Enable. When disabled, configurations settings for the Master function are not changed, but the Master function is internally reset.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MSTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The I2C Master function is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The I2C Master function is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
