cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>INTENCLR</name>
					<description>Interrupt Enable Clear register. Allows clearing any combination of bits in the INTENSET register. Writing a 1 to any implemented bit position causes the corresponding bit to be cleared.</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>reserved5</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>17</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ABERRCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>RXNOISECLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PARITYERRCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>FRAMERRCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>STARTCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DELTARXBRKCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved4</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved3</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>TXDISCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DELTACTSCLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>TXIDLECLR</name>
							<description>Writing 1 clears the corresponding bit in the INTENSET register.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BRG</name>
					<description>Baud Rate Generator register. 16-bit integer baud rate divisor value.</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>BRGVAL</name>
							<description>This value is used to divide the USART input clock to determine the baud rate, based on the input clock from the FRG. 0 = FCLK is used directly by the USART function. 1 = FCLK is divided by 2 before use by the USART function. 2 = FCLK is divided by 3 before use by the USART function. 0xFFFF = FCLK is divided by 65,536 before use by the USART function.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSTAT</name>
					<description>Interrupt status register. Reflects interrupts that are currently enabled.</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0001f968</resetMask>
					<fields>
						<field>
							<name>reserved4</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>17</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ABERRINT</name>
							<description>Auto baud Error Interrupt flag.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXNOISEINT</name>
							<description>Received Noise interrupt flag.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PARITYERRINT</name>
							<description>Parity Error interrupt flag.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FRAMERRINT</name>
							<description>Framing Error interrupt flag.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>START</name>
							<description>This bit is set when a start is detected on the receiver input.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DELTARXBRK</name>
							<description>This bit is set when a change in the state of receiver break detection occurs.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved3</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUNINT</name>
							<description>Overrun Error interrupt flag.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXDISINT</name>
							<description>Transmitter Disabled Interrupt flag.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DELTACTS</name>
							<description>This bit is set when a change in the state of the CTS input is detected.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXIDLE</name>
							<description>Transmitter Idle status.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSR</name>
					<description>Oversample selection register for asynchronous communication.</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x0000000f</resetValue>
					<resetMask>0x0000000f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved, the value read from a reserved bit is not defined.</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>OSRVAL</name>
							<description>Oversample Selection Value. 0 to 3 = not supported 0x4 = 5 function clocks are used to transmit and receive each data bit. 0x5 = 6 function clocks are used to transmit and receive each data bit. 0xF= 16 function clocks are used to transmit and receive each data bit.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADDR</name>
					<description>Address register for automatic address matching.</description>
					<addressOffset>0x2c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved, the value read from a reserved bit is not defined.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ADDRESS</name>
							<description>8-bit address used with automatic address matching. Used when address detection is enabled (ADDRDET in CTL = 1) and automatic address matching is enabled (AUTOADDR in CFG = 1).</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOCFG</name>
					<description>FIFO configuration and enable register.</description>
					<addressOffset>0xe00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0007f033</resetMask>
					<fields>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>19</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>POPDBG</name>
							<description>Pop FIFO for debug reads.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>POPDBG_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DO_NOT_POP</name>
									<description>Debug reads of the FIFO do not pop the FIFO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POP</name>
									<description>A debug read will cause the FIFO to pop.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMPTYRX</name>
							<description>Empty command for the receive FIFO. When a 1 is written to this bit, the RX FIFO is emptied.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMPTYTX</name>
							<description>Empty command for the transmit FIFO. When a 1 is written to this bit, the TX FIFO is emptied.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WAKERX</name>
							<description>Wake-up for receive FIFO level. This allows the device to be woken from reduced power modes (up to power-down, as long as the peripheral function works in that power mode) without enabling the TXLVL interrupt. Only DMA wakes up, processes data, and goes back to sleep. The CPU will remain stopped until woken by another cause, such as DMA completion. See Hardware Wake-up control register.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WAKERX_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Only enabled interrupts will wake up the device form reduced power modes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A device wake-up for DMA will occur if the receive FIFO level reaches the value specified by RXLVL in FIFOTRIG, even when the RXLVL interrupt is not enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKETX</name>
							<description>Wake-up for transmit FIFO level. This allows the device to be woken from reduced power modes (up to power-down, as long as the peripheral function works in that power mode) without enabling the TXLVL interrupt. Only DMA wakes up, processes data, and goes back to sleep. The CPU will remain stopped until woken by another cause, such as DMA completion. See &#128;&#156;Hardware Wake-up control register.</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>WAKETX_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Only enabled interrupts will wake up the device form reduced power modes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>A device wake-up for DMA will occur if the transmit FIFO level reaches the value specified by TXLVL in FIFOTRIG, even when the TXLVL interrupt is not enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMARX</name>
							<description>DMA configuration for receive.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DMARX_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DMA is not used for the receive function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Trigger DMA for the receive function if the FIFO is not empty. Generally, data interrupts would be disabled if DMA is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMATX</name>
							<description>DMA configuration for transmit.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DMATX_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DMA is not used for the transmit function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Trigger DMA for the transmit function if the FIFO is not full. Generally, data interrupts would be disabled if DMA is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>6</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SIZE</name>
							<description>FIFO size configuration. This is a read-only field. 0x0 = FIFO is configured as 16 entries of 8 bits. 0x1, 0x2, 0x3 = not applicable to USART.</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ENABLERX</name>
							<description>Enable the receive FIFO.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ENABLERX_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The receive FIFO is not enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The receive FIFO is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLETX</name>
							<description>Enable the transmit FIFO.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ENABLETX_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The transmit FIFO is not enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The transmit FIFO is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
