cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>FIFOCTRL1</name>
					<description>FIFO Control register 1</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x001f000f</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>21</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>TRIGLVL</name>
							<description>FIFO trigger level. Selects the data trigger level for interrupt or DMA operation. If enabled to do so, the FIFO level can wake up the device just enough to perform DMA, then return to the reduced power mode See Section 4.5.66 'Hardware Wake-up control register'. 0 = trigger when the FIFO has received one entry (is no longer empty). 1 = trigger when the FIFO has received two entries. 15 = trigger when the FIFO has received 16 entries (has become full).</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMA enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DMAEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DMA requests are not enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>DMA requests based on FIFO level are enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTEN</name>
							<description>Interrupt enable.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>INTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>FIFO level interrupts are not enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>FIFO level interrupts are enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET</name>
							<description>FIFO reset.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>RESET_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal operation</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset the FIFO. This bit must be cleared before resuming operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>FIFO enable.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ENABLE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>FIFO is not enabled. Enabling a DMIC channel with the FIFO disabled could be useful while data is being streamed to the I2S, or in order to avoid a filter settling delay when a channel is re-enabled after a period when the data was not needed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>FIFO is enabled. The FIFO must be enabled in order for the CPU or DMA to read data from the DMIC via the FIFODATA register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOSTAT1</name>
					<description>FIFO Status register 1</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>UNDERRUN</name>
							<description>Underrun flag. Indicates that a FIFO underflow has occurred at some point. Writing a one to this bit clears the flag.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag. Indicates that a FIFO overflow has occurred at some point. Writing a one to this bit clears the flag. This flag does not cause an interrupt.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INT</name>
							<description>Interrupt flag. Asserted when FIFO data reaches the level specified in the FIFOCTRL register. Writing a one to this bit clears the flag. Remark: note that the bus clock to the DMIC subsystem must be running in order for an interrupt to occur.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFODATA1</name>
					<description>FIFO Data Register 1</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00ffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DATA</name>
							<description>Data from the top of the input filter FIFO.</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDMSRCCFG1</name>
					<description>PDM Source Configuration register 1</description>
					<addressOffset>0x18c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>PHY_HALF</name>
							<description>Half rate sampling</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PHY_HALF_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>STANDARD</name>
									<description>Standard half rate sampling. The clock to the DMIC is sent at the same rate as the decimator is providing.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALF_RATE</name>
									<description>Use half rate sampling. The clock to the DMIC is sent at half the rate as the decimator is providing.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHY_FALL</name>
							<description>Capture PDM_DATA</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PHY_FALL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Capture PDM_DATA on the rising edge of PDM_CLK.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Capture PDM_DATA on the falling edge of PDM_CLK.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCCTRL1</name>
					<description>DC Control register 1</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000001f3</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SATURATEAT16BIT</name>
							<description>Selects 16-bit saturation.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SATURATEAT16BIT_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DO_NOT_SATURATE</name>
									<description>Results roll over if out range and do not saturate.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SATURATE</name>
									<description>If the result overflows, it saturates at 0xFFFF for positive overflow and 0x8000 for negative overflow.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCGAIN</name>
							<description>Fine gain adjustment in the form of a number of bits to downshift.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DCPOLE</name>
							<description>DC block filter</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>DCPOLE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>FLAT_RESPONSE</name>
									<description>Flat response, no filter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>155_HZ</name>
									<description>155 Hz.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>78_HZ</name>
									<description>78 Hz.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>39_HZ</name>
									<description>39 Hz</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHANEN</name>
					<description>Channel Enable register</description>
					<addressOffset>0xf00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>EN_CH1</name>
							<description>Enable channel 1. When 1, PDM channel 1 is enabled.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EN_CH0</name>
							<description>Enable channel 0. When 1, PDM channel 0 is enabled.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCFG</name>
					<description>I/O Configuration register</description>
					<addressOffset>0xf0c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000007</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>3</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>STEREO_DATA0</name>
							<description>Stereo PDM select. When 1, PDM_DATA0 is routed to both PDM channels in a configuration that supports a single stereo digital microphone.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLK_BYPASS1</name>
							<description>Bypass CLK1. When 1, PDM_DATA1 becomes the clock for PDM channel 1. This provides for the possibility of an external codec taking over the PDM bus.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CLK_BYPASS0</name>
							<description>Bypass CLK0. When 1, PDM_DATA1 becomes the clock for PDM channel 0. This provides for the possibility of an external codec taking over the PDM bus.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>USE2FS</name>
					<description>Use 2FS register</description>
					<addressOffset>0xf10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>USE2FS</name>
							<description>Use 2FS register</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>USE2FS_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>1FS</name>
									<description>Use 1FS output for PCM data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2FS</name>
									<description>Use 2FS output for PCM data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADGAIN</name>
					<description>HWVAD input gain register</description>
					<addressOffset>0xf80</addressOffset>
					<size>32</size>
					<resetValue>0x00000005</resetValue>
					<resetMask>0x0000000f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>INPUTGAIN</name>
							<description>Shift value for input bits 0x00 -10 bits 0x01 -8 bits 0x02 -6 bits 0x03 -4 bits 0x04 -2 bits 0x05 0 bits (default) 0x06 +2 bits 0x07 +4 bits 0x08 +6 bits 0x09 +8 bits 0x0A +10 bits 0x0B +12 bits 0x0C +14 bits 0x0D to 0x0F Reserved.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADHPFS</name>
					<description>HWVAD filter control register</description>
					<addressOffset>0xf84</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>HPFS</name>
							<description>High pass filter</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>HPFS_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>BYPASS</name>
									<description>First filter by-pass.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_PASS_1750HZ</name>
									<description>High pass filter with -3dB cut-off at 1750Hz.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_PASS_215HZ</name>
									<description>High pass filter with -3dB cut-off at 215Hz.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADST10</name>
					<description>HWVAD control register</description>
					<addressOffset>0xf88</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ST10</name>
							<description>Stage 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ST10_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal operation, waiting for HWVAD trigger event (stage 0).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset internal interrupt flag by writing a '1' pulse.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADRSTT</name>
					<description>HWVAD filter reset register</description>
					<addressOffset>0xf8c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000001</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written</description>
							<lsb>1</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>RSTT</name>
							<description>Writing a 1 resets all filter values</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADTHGN</name>
					<description>HWVAD noise estimator gain register</description>
					<addressOffset>0xf90</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>THGN</name>
							<description>Gain value for the noise estimator. Values 0 to 14. 0 corresponds to a gain of 1.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADTHGS</name>
					<description>HWVAD signal estimator gain register</description>
					<addressOffset>0xf94</addressOffset>
					<size>32</size>
					<resetValue>0x00000004</resetValue>
					<resetMask>0x0000000f</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>THGS</name>
							<description>Gain value for the signal estimator. Values 0 to 14. 0 corresponds to a gain of 1.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HWVADLOWZ</name>
					<description>HWVAD noise envelope estimator register</description>
					<addressOffset>0xf98</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000ffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LOWZ</name>
							<description>Noise envelope estimator value.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification register</description>
					<addressOffset>0xffc</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>Indicates module ID and the number of channels in this DMIC interface.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
