cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>MSTCTL</name>
					<description>Master control register.</description>
					<addressOffset>0x820</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000000e</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MSTDMA</name>
							<description>Master DMA enable. Data operations of the I2C can be performed with DMA. Protocol type operations such as Start, address, Stop, and address match must always be done with software, typically via an interrupt. Address acknowledgement must also be done by software except when the I2C is configured to be HSCAPABLE (and address acknowledgement is handled entirely by hardware) or when Automatic Operation is enabled. When a DMA data transfer is complete, MSTDMA must be cleared prior to beginning the next operation, typically a Start or Stop.This bit is read/write.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MSTDMA_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable. No DMA requests are generated for master operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable. A DMA request is generated for I2C master data operations. When this I2C master is generating Acknowledge bits in Master Receiver mode, the acknowledge is generated automatically.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTSTOP</name>
							<description>Master Stop control. This bit is write-only.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MSTSTOP_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop. A Stop will be generated on the I2C bus at the next allowed time, preceded by a NACK to the slave if the master is receiving data from the slave (Master Receiver mode).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTSTART</name>
							<description>Master Start control. This bit is write-only.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MSTSTART_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start. A Start will be generated on the I2C bus at the next allowed time.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSTCONTINUE</name>
							<description>Master Continue. This bit is write-only.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
							<enumeratedValues>
								<name>MSTCONTINUE_enum_write</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTINUE</name>
									<description>Continue. Informs the Master function to continue to the next operation. This must done after writing transmit data, reading received data, or any other housekeeping related to the next bus operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MSTTIME</name>
					<description>Master timing configuration.</description>
					<addressOffset>0x824</addressOffset>
					<size>32</size>
					<resetValue>0x00000077</resetValue>
					<resetMask>0x00000077</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>7</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MSTSCLHIGH</name>
							<description>Master SCL High time. Specifies the minimum high time that will be asserted by this master on SCL. Other masters in a multi-master system could shorten this time. This corresponds to the parameter tHIGH in the I2C bus specification. I2C bus specification parameters tSU;STO and tHD;STA have the same values and are also controlled by MSTSCLHIGH.</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MSTSCLHIGH_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>2_CLOCKS</name>
									<description>2 clocks. Minimum SCL high time is 2 clock of the I2C clock pre-divider.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_CLOCKS</name>
									<description>3 clocks. Minimum SCL high time is 3 clocks of the I2C clock pre-divider .</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS</name>
									<description>4 clocks. Minimum SCL high time is 4 clock of the I2C clock pre-divider.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS</name>
									<description>5 clocks. Minimum SCL high time is 5 clock of the I2C clock pre-divider.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS</name>
									<description>6 clocks. Minimum SCL high time is 6 clock of the I2C clock pre-divider.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS</name>
									<description>7 clocks. Minimum SCL high time is 7 clock of the I2C clock pre-divider.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS</name>
									<description>8 clocks. Minimum SCL high time is 8 clock of the I2C clock pre-divider.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS</name>
									<description>9 clocks. Minimum SCL high time is 9 clocks of the I2C clock pre-divider.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>MSTSCLLOW</name>
							<description>Master SCL Low time. Specifies the minimum low time that will be asserted by this master on SCL. Other devices on the bus (masters or slaves) could lengthen this time. This corresponds to the parameter t LOW in the I2C bus specification. I2C bus specification parameters tBUF and tSU;STA have the same values and are also controlled by MSTSCLLOW.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>MSTSCLLOW_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>2_CLOCKS</name>
									<description>2 clocks. Minimum SCL low time is 2 clocks of the I2C clock pre-divider.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3_CLOCKS</name>
									<description>3 clocks. Minimum SCL low time is 3 clocks of the I2C clock pre-divider.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS</name>
									<description>4 clocks. Minimum SCL low time is 4 clocks of the I2C clock pre-divider.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS</name>
									<description>5 clocks. Minimum SCL low time is 5 clocks of the I2C clock pre-divider.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS</name>
									<description>6 clocks. Minimum SCL low time is 6 clocks of the I2C clock pre-divider.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS</name>
									<description>7 clocks. Minimum SCL low time is 7 clocks of the I2C clock pre-divider.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS</name>
									<description>8 clocks. Minimum SCL low time is 8 clocks of the I2C clock pre-divider.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS</name>
									<description>9 clocks. Minimum SCL low time is 9 clocks of the I2C clock pre-divider.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MSTDAT</name>
					<description>Combined Master receiver and transmitter data register.</description>
					<addressOffset>0x828</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DATA</name>
							<description>Master function data register. Read: read the most recently received data for the Master function. Write: transmit data using the Master function.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SLVCTL</name>
					<description>Slave control register.</description>
					<addressOffset>0x840</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000030b</resetMask>
					<fields>
						<field>
							<name>reserved2</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>10</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>AUTOMATCHREAD</name>
							<description>When AUTOACK is set, this bit controls whether it matches a read or write request on the next header with an address matching SLVADR0. Since DMA needs to be configured to match the transfer direction, the direction needs to be specified. This bit allows a direction to be chosen for the next operation.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>AUTOMATCHREAD_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>I2C_WRITE</name>
									<description>The expected next operation in Automatic Mode is an I2C write.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C_READ</name>
									<description>The expected next operation in Automatic Mode is an I2C read.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTOACK</name>
							<description>Automatic Acknowledge.When this bit is set, it will cause an I2C header which matches SLVADR0 and the direction set by AUTOMATCHREAD to be ACKed immediately; this is used with DMA to allow processing of the data without intervention. If this bit is clear and a header matches SLVADR0, the behavior is controlled by AUTONACK in the SLVADR0 register: allowing NACK or interrupt.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>AUTOACK_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal, non-automatic operation. If AUTONACK = 0, an SlvPending interrupt is generated when a matching address is received. If AUTONACK = 1, received addresses are NACKed (ignored).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTOMATIC_ACK</name>
									<description>A header with matching SLVADR0 and matching direction as set by AUTOMATCHREAD will be ACKed immediately, allowing the master to move on to the data bytes. If the address matches SLVADR0, but the direction does not match AUTOMATCHREAD, the behavior will depend on the AUTONACK bit in the SLVADR0 register: if AUTONACK is set, then it will be Nacked; else if AUTONACK is clear, then a SlvPending interrupt is generated.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SLVDMA</name>
							<description>Slave DMA enable.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SLVDMA_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. No DMA requests are issued for Slave mode operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. DMA requests are issued for I2C slave data transmission and reception.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SLVNACK</name>
							<description>Slave NACK.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SLVNACK_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NACK</name>
									<description>NACK. Causes the Slave function to NACK the master when the slave is receiving data from the master (Slave Receiver mode).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLVCONTINUE</name>
							<description>Slave Continue.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SLVCONTINUE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_EFFECT</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONTINUE</name>
									<description>Continue. Informs the Slave function to continue to the next operation, by clearing the SLVPENDING flag in the STAT register. This must be done after writing transmit data, reading received data, or any other housekeeping related to the next bus operation. Automatic Operation has different requirements. SLVCONTINUE should not be set unless SLVPENDING = 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SLVDAT</name>
					<description>Combined Slave receiver and transmitter data register.</description>
					<addressOffset>0x844</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>DATA</name>
							<description>Slave function data register. Read: read the most recently received data for the Slave function. Write: transmit data using the Slave function.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<dimIndex>0,1,2</dimIndex>
					<name>SLVADR[%s]</name>
					<description>Slave address register.</description>
					<addressOffset>0x848</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SLVADR</name>
							<description>Slave Address. Seven bit slave address that is compared to received addresses if enabled.</description>
							<lsb>1</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SADISABLE</name>
							<description>Slave Address n Disable.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SADISABLE_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. Slave Address n is enabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignored Slave Address n is ignored.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SLVQUAL0</name>
					<description>Slave Qualification for address 0.</description>
					<addressOffset>0x858</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000000ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>SLVQUAL0</name>
							<description>Slave address Qualifier for address 0. A value of 0 causes the address in SLVADR0 to be used as-is, assuming that it is enabled. If QUALMODE0 = 0, any bit in this field which is set to 1 will cause an automatic match of the corresponding bit of the received address when it is compared to the SLVADR0 register. If QUALMODE0 = 1, an address range is matched for address 0. This range extends from the value defined by SLVADR0 to the address defined by SLVQUAL0 (address matches when SLVADR0[7:1] &amp;lt;= received address &amp;lt;= SLVQUAL0[7:1]).</description>
							<lsb>1</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>QUALMODE0</name>
							<description>Qualify mode for slave address 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>QUALMODE0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>MASK</name>
									<description>Mask. The SLVQUAL0 field is used as a logical mask for matching address 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTEND</name>
									<description>Extend. The SLVQUAL0 field is used to extend address 0 matching in a range of addresses.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
