cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>MONRXDAT</name>
					<description>Monitor receiver data register.</description>
					<addressOffset>0x880</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x000007ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>11</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MONNACK</name>
							<description>Monitor Received NACK.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>MONNACK_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>ACKNOWLEDGED</name>
									<description>Acknowledged. The data currently being provided by the Monitor function was acknowledged by at least one master or slave receiver.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOT_ACKNOWLEDGED</name>
									<description>Not acknowledged. The data currently being provided by the Monitor function was not acknowledged by any receiver.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONRESTART</name>
							<description>Monitor Received Repeated Start.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>MONRESTART_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NOT_DETECTED</name>
									<description>No repeated start detected. The Monitor function has not detected a Repeated Start event on the I2C bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECTED</name>
									<description>Repeated start detected. The Monitor function has detected a Repeated Start event on the I2C bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONSTART</name>
							<description>Monitor Received Start.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>MONSTART_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_START_DETECTED</name>
									<description>No start detected. The Monitor function has not detected a Start event on the I2C bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START_DETECTED</name>
									<description>Start detected. The Monitor function has detected a Start event on the I2C bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONRXDAT</name>
							<description>Monitor function Receiver Data. This reflects every data byte that passes on the I2C pins.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>I2C module Identification. This value appears in the shared Flexcomm peripheral ID register when I2C is selected.</description>
					<addressOffset>0xffc</addressOffset>
					<size>32</size>
					<resetValue>0xe0300000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>Unique module identifier for this IP block.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MAJOR_REV</name>
							<description>Major revision of module implementation, starting at 0. There may not be software compatibility between major revisions.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MINOR_REV</name>
							<description>Minor revision of module implementation, starting at 0. Minor revision of module implementation, starting at 0. Software compatibility is expected between minor revisions.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>APERTURE</name>
							<description>Aperture: encoded as (aperture size/4K) -1, so 0x00 means a 4K aperture.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>FLEXCOMM6</name>
			<version>1.0</version>
			<description>LPC5411x Flexcomm serial communication</description>
			<groupName>flexcomm</groupName>
			<baseAddress>0x40097000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PSELID</name>
					<description>Peripheral Select and Flexcomm ID register.</description>
					<addressOffset>0xff8</addressOffset>
					<size>32</size>
					<resetValue>0x00101000</resetValue>
					<resetMask>0xfffff0ff</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>Flexcomm ID.</description>
							<lsb>12</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>I2SPRESENT</name>
							<description>I 2S present indicator. This field is Read-only.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>I2SPRESENT_enum_read</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>NOT_PRESENT</name>
									<description>This Flexcomm does not include the I2S function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT</name>
									<description>This Flexcomm includes the I2S function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2CPRESENT</name>
							<description>I2C present indicator. This field is Read-only.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>I2CPRESENT_enum_read</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>NOT_PRESENT</name>
									<description>This Flexcomm does not include the I2C function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT</name>
									<description>This Flexcomm includes the I2C function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPIPRESENT</name>
							<description>SPI present indicator. This field is Read-only.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>SPIPRESENT_enum_read</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>NOT_PRESENT</name>
									<description>This Flexcomm does not include the SPI function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT</name>
									<description>This Flexcomm includes the SPI function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USARTPRESENT</name>
							<description>USART present indicator. This field is Read-only.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>USARTPRESENT_enum_read</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>NOT_PRESENT</name>
									<description>This Flexcomm does not include the USART function.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PRESENT</name>
									<description>This Flexcomm includes the USART function.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock the peripheral select. This field is writable by software.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>LOCK_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Peripheral select can be changed by software.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Peripheral select is locked and cannot be changed until this Flexcomm or the entire device is reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PERSEL</name>
							<description>Peripheral Select. This field is writable by software.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>PERSEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>NO_PERIPH_SELECTED</name>
									<description>No peripheral selected.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USART</name>
									<description>USART function selected.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI</name>
									<description>SPI function selected.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2C</name>
									<description>I2C function selected.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_TRANSMIT</name>
									<description>I2S transmit function selected.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>I2S_RECEIVE</name>
									<description>I2S receive function selected.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PID</name>
					<description>Peripheral identification register.</description>
					<addressOffset>0xffc</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xffffff00</resetMask>
					<fields>
						<field>
							<name>ID</name>
							<description>Module identifier for the selected function.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Major_Rev</name>
							<description>Major revision of module implementation.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Minor_Rev</name>
							<description>Minor revision of module implementation.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>-</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
