cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>THR0_LOW</name>
					<description>ADC Low Compare Threshold register 0: Contains the lower threshold level for automatic threshold comparison for any channels linked to threshold pair 0.</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000fff0</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>THRLOW</name>
							<description>Low threshold value against which ADC results will be compared</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THR1_LOW</name>
					<description>ADC Low Compare Threshold register 1: Contains the lower threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000fff0</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>THRLOW</name>
							<description>Low threshold value against which ADC results will be compared</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THR0_HIGH</name>
					<description>ADC High Compare Threshold register 0: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 0.</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000fff0</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>THRHIGH</name>
							<description>High threshold value against which ADC results will be compared</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THR1_HIGH</name>
					<description>ADC High Compare Threshold register 1: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
					<addressOffset>0x5c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x0000fff0</resetMask>
					<fields>
						<field>
							<name>reserved1</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>THRHIGH</name>
							<description>High threshold value against which ADC results will be compared</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHAN_THRSEL</name>
					<description>ADC Channel-Threshold Select register. Specifies which set of threshold compare registers are to be used for each channel</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000fff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>12</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CH11_THRSEL</name>
							<description>Threshold select for channel 11. See description for channel 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH10_THRSEL</name>
							<description>Threshold select for channel 10. See description for channel 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH9_THRSEL</name>
							<description>Threshold select for channel 9. See description for channel 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH8_THRSEL</name>
							<description>Threshold select for channel 8. See description for channel 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH7_THRSEL</name>
							<description>Threshold select for channel 7. See description for channel 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH6_THRSEL</name>
							<description>Threshold select for channel 6. See description for channel 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH5_THRSEL</name>
							<description>Threshold select for channel 5. See description for channel 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH4_THRSEL</name>
							<description>Threshold select for channel 4. See description for channel 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH3_THRSEL</name>
							<description>Threshold select for channel 3. See description for channel 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH2_THRSEL</name>
							<description>Threshold select for channel 2. See description for channel 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH1_THRSEL</name>
							<description>Threshold select for channel 1. See description for channel 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CH0_THRSEL</name>
							<description>Threshold select for channel 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>CH0_THRSEL_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>THRESHOLD0</name>
									<description>Threshold 0. Results for this channel will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THRESHOLD1</name>
									<description>Threshold 1. Results for this channel will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN</name>
					<description>ADC Interrupt Enable register. This register contains enable bits that enable the sequence-A, sequence-B, threshold compare and data overrun interrupts to be generated.</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x07ffffff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ADCMPINTEN11</name>
							<description>Channel 21 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN10</name>
							<description>Channel 10 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>23</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN9</name>
							<description>Channel 9 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>21</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN8</name>
							<description>Channel 8 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN7</name>
							<description>Channel 7 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>17</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN6</name>
							<description>Channel 6 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>15</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN5</name>
							<description>Channel 5 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>13</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN4</name>
							<description>Channel 4 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN3</name>
							<description>Channel 3 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN2</name>
							<description>Channel 2 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>7</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN1</name>
							<description>Channel 1 threshold comparison interrupt enable. See description for channel 0.</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADCMPINTEN0</name>
							<description>Threshold comparison interrupt enable for channel 0.</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>ADCMPINTEN0_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTSIDE_THRESHOLD</name>
									<description>Outside threshold.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CROSSING_THRESHOLD</name>
									<description>Crossing threshold.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVR_INTEN</name>
							<description>Overrun interrupt enable.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>OVR_INTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The overrun interrupt is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The overrun interrupt is enabled. Detection of an overrun condition on any of the 12 channel data registers will cause an overrun interrupt/DMA trigger. In addition, if the MODE bit for a particular sequence is 0, then an overrun in the global data register for that sequence will also cause this interrupt/DMA trigger to be asserted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEQB_INTEN</name>
							<description>Sequence B interrupt enable.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEQB_INTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The sequence B interrupt/DMA trigger is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The sequence B interrupt/DMA trigger is enabled and will be asserted either upon completion of each individual conversion performed as part of sequence B, or upon completion of the entire B sequence of conversions, depending on the MODE bit in the SEQB_CTRL register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEQA_INTEN</name>
							<description>Sequence A interrupt enable.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>SEQA_INTEN_enum_read_write</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled. The sequence A interrupt/DMA trigger is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled. The sequence A interrupt/DMA trigger is enabled and will be asserted either upon completion of each individual conversion performed as part of sequence A, or upon completion of the entire A sequence of conversions, depending on the MODE bit in the SEQA_CTRL register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
