cmsis-svd/cmsis-svd/data/NXP/LPC5411x_cm4.svd
				<register>
					<name>FLAGS</name>
					<description>ADC Flags register. Contains the four interrupt/DMA trigger flags and the individual component overrun and threshold-compare flags. (The overrun bits replicate information stored in the result registers).</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xf3ffffff</resetMask>
					<fields>
						<field>
							<name>OVR_INT</name>
							<description>Overrun Interrupt flag. Any overrun bit in any of the individual channel data registers will cause this interrupt. In addition, if the MODE bit in either of the SEQn_CTRL registers is 0 then the OVERRUN bit in the corresponding SEQn_GDAT register will also cause this interrupt. This interrupt must be enabled in the INTEN register. This bit will be cleared when all of the individual overrun bits have been cleared via reading the corresponding data registers.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP_INT</name>
							<description>Threshold Comparison Interrupt. This bit will be set if any of the THCMP flags in the lower bits of this register are set to 1 (due to an enabled out-of-range or threshold-crossing event on any channel). Each type of threshold comparison interrupt on each channel must be individually enabled in the INTEN register to cause this interrupt. This bit will be cleared when all of the individual threshold flags are cleared via writing 1s to those bits.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQB_INT</name>
							<description>Sequence A interrupt/DMA trigger. If the MODE bit in the SEQB_CTRL register is 0, this flag will mirror the DATAVALID bit in the sequence A global data register (SEQB_GDAT), which is set at the end of every ADC conversion performed as part of sequence B. It will be cleared automatically when the SEQB_GDAT register is read. If the MODE bit in the SEQB_CTRL register is 1, this flag will be set upon completion of an entire B sequence. In this case it must be cleared by writing a 1 to this SEQB_INT bit. This interrupt must be enabled in the INTEN register.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQA_INT</name>
							<description>Sequence A interrupt/DMA trigger. If the MODE bit in the SEQA_CTRL register is 0, this flag will mirror the DATAVALID bit in the sequence A global data register (SEQA_GDAT), which is set at the end of every ADC conversion performed as part of sequence A. It will be cleared automatically when the SEQA_GDAT register is read. If the MODE bit in the SEQA_CTRL register is 1, this flag will be set upon completion of an entire A sequence. In this case it must be cleared by writing a 1 to this SEQA_INT bit. This interrupt must be enabled in the INTEN register.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>reserved0</name>
							<description>Reserved.</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQB_OVR</name>
							<description>Mirrors the global OVERRUN status flag in the SEQB_GDAT register</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SEQA_OVR</name>
							<description>Mirrors the global OVERRUN status flag in the SEQA_GDAT register</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN11</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 11</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN10</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 10</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN9</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 9</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN8</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 8</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN7</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 7</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN6</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 6</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN5</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 5</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN4</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 4</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN3</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 3</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN2</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 2</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN1</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVERRUN0</name>
							<description>Mirrors the OVERRRUN status flag from the result register for ADC channel 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP11</name>
							<description>Threshold comparison event on Channel 11. See description for channel 0.</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP10</name>
							<description>Threshold comparison event on Channel 10. See description for channel 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP9</name>
							<description>Threshold comparison event on Channel 9. See description for channel 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP8</name>
							<description>Threshold comparison event on Channel 8. See description for channel 0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP7</name>
							<description>Threshold comparison event on Channel 7. See description for channel 0.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP6</name>
							<description>Threshold comparison event on Channel 6. See description for channel 0.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP5</name>
							<description>Threshold comparison event on Channel 5. See description for channel 0.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP4</name>
							<description>Threshold comparison event on Channel 4. See description for channel 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP3</name>
							<description>Threshold comparison event on Channel 3. See description for channel 0.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP2</name>
							<description>Threshold comparison event on Channel 2. See description for channel 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP1</name>
							<description>Threshold comparison event on Channel 1. See description for channel 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>THCMP0</name>
							<description>Threshold comparison event on Channel 0. Set to 1 upon either an out-of-range result or a threshold-crossing result if enabled to do so in the INTEN register. This bit is cleared by writing a 1.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STARTUP</name>
					<description>ADC Startup register.</description>
					<addressOffset>0x6c</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000003</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>2</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>ADC_INIT</name>
							<description>ADC Initialization. After enabling the ADC (setting the ADC_ENA bit), the API routine will EITHER set this bit or the CALIB bit in the CALIB register, depending on whether or not calibration is required. Setting this bit will launch the '&#156;dummy'&#157; conversion cycle that is required if a calibration is not performed. It will also reload the stored calibration value from a previous calibration unless the BYPASSCAL bit is set. This bit should only be set AFTER the ADC_ENA bit is set and after the CALIREQD bit is tested to determine whether a calibration or an ADC dummy conversion cycle is required. It should not be set during the same write that sets the ADC_ENA bit. This bit can only be set to a '&#152;1'&#153; by software. It is cleared automatically when the '&#156;dummy'&#157; conversion cycle completes.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC_ENA</name>
							<description>ADC Enable bit. This bit can only be set to a 1 by software. It is cleared automatically whenever the ADC is powered down. This bit must not be set until at least 10 microseconds after the ADC is powered up (typically by altering a system-level ADC power control bit).</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CALIB</name>
					<description>ADC Calibration register.</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0x000001ff</resetMask>
					<fields>
						<field>
							<name>reserved0</name>
							<description>Reserved. Read value is undefined, only zero should be written.</description>
							<lsb>9</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<modifiedWriteValues>modify</modifiedWriteValues>
						</field>
						<field>
							<name>CALVALUE</name>
							<description>Calibration Value. This read-only field displays the calibration value established during last calibration cycle. This value is not typically of any use to the user.</description>
							<lsb>2</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALREQD</name>
							<description>Calibration required. This read-only bit indicates if calibration is required when enabling the ADC. CALREQD will be '&#152;1'&#153; if no calibration has been run since the chip was powered-up and if the BYPASSCAL bit in the CTRL register is low. Software will test this bit to determine whether to initiate a calibration cycle or whether to set the ADC_INIT bit (in the STARTUP register) to launch the ADC initialization process which includes a '&#156;dummy'&#157; conversion cycle. Note: A '&#156;dummy'&#157; conversion cycle requires approximately 6 ADC clocks as opposed to 81 clocks required for calibration.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALIB</name>
							<description>Calibration request. Setting this bit will launch an ADC calibration cycle. This bit can only be set to a '&#152;1'&#153; by software. It is cleared automatically when the calibration cycle completes.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
